{"51":{"explanation":"51星释义：暂无51","zhu":"0"},"52":{"explanation":"52星释义：暂无","zhu":"0"},"天空":{"explanation":"天空：落空丶玄学丶破财丶坠伤丶刑伤。创思力高。","zhu":"0"},"右弼":{"explanation":"右弼∶强力帮助主星的力量，压制凶星，展现让你如意。","zhu":"0"},"破军":{"explanation":{"迁移宫":"破军於迁移宫：(1)命里作客他乡人，入四马宫(寅申巳亥)更验。(2)加煞流於江湖卖艺。(3)破军加昌曲，为优秀演艺人员或技术人才。","子女宫":"破军於子女宫：(1)子女缘薄，破军廉贞有一子，但见六煞无子望。(2)女命更为甚，易流产（失）丶堕胎。(3)有子女亦不易管教，好动丶破坏力强，又如到手之玩具，马上会解剖成零件。","父母宫":"破军星於父母宫： 比较容易与父母争执丶意见不一，所以在亲子沟通方面需加强。","福德宫":"破军星於福德宫：一生奔忙，虽然日日勉力於工作却不见收获的到来。日日烦躁，心理上无法平静。","交友宫":"破军於交友宫：朋友大多是具有实际力量的人。","夫妻宫":"破军於夫妻宫：没有正常婚姻的观念，不喜欢设定的婚姻关系，而追求一种没有约束的感情生涯，因此如果早婚的话都带给配偶很大的伤害，最後以生死离别的悲剧来结束，晚婚较佳。","事业宫":"破军於事业宫：主武职显发，威震华夷。(1)变动性质的工作，利武职不利文职。(2)破车武曲加吉，可任要职。破军廉贞亦可任武职，但文人则不能持久。","兄弟宫":"破军於兄弟宫：兄弟姊妹情缘淡薄，不易打成一片，宜向外求发展。兄弟无缘各自为政。","疾厄宫":"破军於疾厄宫：幼年多脓血之灾。主心脏机能弱，另主阴亏，血气不和，不是驼腰，必病肾。","田宅宫":"破军於田宅宫：(1)房地产有成败。(2)运限逢之有搬家机会。","身命宫":"破军於身命宫：破军个性刚强好胜丶喜开创，心急缺乏耐性，冒险投机，改革变化。遇事多疑，敢言敢为，但稍具神经质。爱憎分明且极端的两极化，此星叛逆性强，不喜受束缚。破军一生有较大幅度之变动，但感情丰富，勇敢正直 。破军凶焰甚高，惟紫微，天梁可制。适合多变丶开创性及机动性钱财，或从事武职，唯不利女命。破军星五短身材，腰背宽厚，厚唇，两眉之间宽阔，眉毛粗；女性则有媚相。破军星之人尚有虚荣丶浪费丶神经质的特质，也易受外於环境影响，所以情绪变化也很快。少言，我行我素，独断独行。分柝力高，但先做後计。喜军警，工程界。<br>◎因破军於子，对宫为廉贞星丶天相星丶为「英星入庙格」 丶破军星具有开创与执行力丶果敢勇为丶人生具有目标丶加会吉星则有建树丶甲年生三奇嘉会丶己年生会照武曲星化禄丶贪狼星则可经商致富丶癸年生破军星会照禄存星及贪狼星化忌丶反过度安逸丶不求进取。若与羊丶陀丶火丶铃丶同宫无厚重的星曜化解丶则个性难免顽嚣。破军个性冲动丶多虎头蛇尾丶持续力不足。","财帛宫":"破军於财帛宫：(1)收入Ⅰ.一生钱财必有变化，往往会先经过挫折丶损失之後，再重新开始。Ⅱ.不重视钱财，也不擅计算丶管理。如於财帛宫时，进财无计帐簿或收支明细。(2)种类Ⅰ.以多种头班进财，或时常变换进财模式。Ⅱ.以冒险性丶开创性丶变化性模式进财，即进财模式与众不同。Ⅲ.此星有异乡财。(3)星化Ⅰ.与化禄丶禄存丶六吉同宫或会照时，或辅弼丶魁钺诸星相助，则∶挫败之後，还能维持原有的，或更好的财务状况，於发生变化时，也不会中断收入。若无上述星化时，於钱财损失後，较难恢复原有收入。Ⅱ.与地劫丶地空同宫，钱财波动大，经商易倾家荡产。Ⅲ.破军武曲∶财来财去。Ⅳ.破军紫微∶财库旺盛。Ⅴ.破军廉贞∶劳力生财。"},"zhu":"1"},"天虚":{"explanation":"天虚：物质上损秏。","zhu":"0"},"灾煞":{"explanation":"灾煞星释义：暂无","zhu":"0"},"天福":{"explanation":"有贵人帮助，助力比天魁天钺低些。","zhu":"0"},"七杀":{"explanation":{"迁移宫":"七杀於迁移宫：在外日多，境遇变化较频繁，忙中安身，天马同宫更主背井离乡。与禄存丶化禄丶昌曲丶辅弼同宫加会，在外可得申明丶地位丶财富。加四煞空劫刑耗忌绝，主流荡天涯，心不宁。羊陀同宫，宜军人武职，若命宫三方吉星少只为体力劳动之人。火铃同宫，宜军人丶警察丶司法人员等，武职峥嵘，不然在外亦突发资财，若命宫三方吉星少，只为贫苦劳力之辈。与天刑或官府同宫并诸凶星，在外遭凶遇险，或有牢狱之灾，且主死于他乡。凡七杀在迁移宫会煞（四煞丶化忌丶天刑），会遭车祸，若再有官府丶官符同宫，尚主有牢狱之灾。","子女宫":"七杀於子女宫：主孤，多流产丶难产。子女少，各在一方，近处亦少住来。入庙旺会左右昌曲魁钺，子女富贵。七杀入子女，主招强横叛逆之子，与双亲反目缘薄，有刑克，子女破相。加煞虽有如无，煞众绝嗣，只宜过继抱养。有化忌会照，多病灾。空劫会照，因子破耗。","父母宫":"七杀於父母宫：不吉之兆，多主父母本身不和，健康不佳，自己亦刑克父母，与父母不睦，或早年即离开父母。纵入庙亦主克，父母之一早年死亡，自己离祖外出。平闲刑克父母，甚至上辈亲人亦克。加煞刑伤甚重，必主双亲有丧，或与父母成仇，不孝敬父母。化忌守照，父母早年刑伤，或事业大败，或顽疾缠身。劫空丶天刑丶劫煞丶孤辰等星守照，均主克。","福德宫":"七杀於福德宫：入庙终身忙碌操劳，尤好逞强争胜，会吉劳心。其理想多偏重于个人的利益，每逢挫折，即感命不如人，怀才不遇，而怨气冲天。平闲或加煞重，思想消极，劳多功少，一生无福。命宫吉者寿达六十以上。","交友宫":"七杀於交友宫：(1)朋友无利丶部属无助，家仆内盗，面是背非。(2)朋友多性烈丶固执丶麻烦多。","夫妻宫":"七杀於夫妻宫：不吉之兆，夫妇性格分歧，多争吵。只有晚婚可获吉祥，能够偕老。早婚男女皆克，加四煞，婚姻悲惨，男克三妻女克三夫。","事业宫":"七杀於事业宫：以军界丶警界能发显，或办工厂实业，而主掌握多数职工者为宜。(1)成败变化大，武官则英豪，文官不合时宜。(2)喜会紫微丶禄存丶左右丶昌曲，主掌权。七杀廉贞有威名。(3)宜外科医师丶金属业丶屠宰业，并防沦人黑道。","兄弟宫":"七杀於兄弟宫：背面不相亲，兄弟缘薄，各分东西，人数亦少。","疾厄宫":"七杀於疾厄宫：主幼年多灾病，或性情燥急丶易怒。(1)主肺，易怒冲肝丶肺，幼年灾厄受伤。(2)七杀丶廉贞∶手足伤残。(3)七杀丶羊刃∶手足刑伤。(4)七杀鸾喜相逢∶开刀丶血光。(5)辛年生人，或营运辛岁，七杀居流疾，主开刀。","田宅宫":"七杀於田宅宫：(1)无煞冲晚发，如加吉暴发户。(2)七杀丶羊刃丶或廉贞，则田宅有争端，防落败祖业。(3)附近有派出所，市场，公共场所为入局。","身命宫":"七杀於命宫：七杀星坐命，具有将相性格，可独力处理外务，也具经营者的行政能力，也擅理财。精明果决，冷酷丶不苟言笑，个性刚强率直，不怒而威，能为众人所信服。七杀情绪不稳定，有冲动潜能，教育程度能改正。七杀一生大变化的机率很高。利军警武职。有离乡背井机会，或从事与海外有关之工作。七杀外型特色为毛发浓，眉毛粗黑。目大神威有霸气，面型长方，暗颧。双骨人，筋肉形。眼大有有霸气，媚眼。个性好胜，明知故犯。爽直，自信心太高。霸道，冲动。有柏力，硬桥硬马。暴戾，难交知心友。喜军警，工程界。因七杀於午，为朝斗。七杀如主帅丶朝斗格的人，肯思考丶富创造力丶才能佳。具谋略丶个性独立且刚强，是个很好的主管人才丶事业人才。","财帛宫":"七杀於财帛宫：七杀於财帛宫：(1)理财擅於理财，与禄存同宫，或会照化禄时，易有理财机会。(2)收入Ⅰ.七杀之财带有偏丶横财运，横发横破，无法守成。Ⅱ.与禄存丶天马同宫，会照化禄化权丶化科及六吉星时，能成巨富。Ⅲ.进财劳神费力，钱财进出数量甚大。(3)波动Ⅰ.即使有成巨富命格，但一生之中不免於钱财上有一次以上的大变化，若大限流年不吉，会有重大损失。Ⅱ.有六煞或化忌，皆要谨慎小心，以免於大变化中倾家荡产，故而不宜经商。Ⅲ.喜会禄马，赚钱速。Ⅳ.逢六煞丶化忌丶空亡定破财。Ⅴ.七杀武曲同宫，逢羊刃，会因是非破财，否则因财持刀。"},"zhu":"1"},"贪狼":{"explanation":{"迁移宫":"贪狼於迁移宫：庙旺之地，闹中横发进财，逢吉化则更主在外地大发财，并多有欢愉享受。在外劳碌，多酒食交际应酬，广结人缘，可遇异性相帮。加桃花星则贪花念酒，易有淫欲之举，如嫖妓丶幽会等，加煞因色或女人而致祸。加四煞空劫丶擎羊丶陀罗丶化忌丶天刑丶大耗诸恶，并主遇盗劫掠，流年迁移宫逢贪狼及上例诸星，且流年的田宅宫不好，必遭小偷。","子女宫":"贪狼於子女宫：本人纵欲，会桃花星未婚同居丶先孕。子女喜与异性交游，少有耐性，入庙善社交，陷在地不务正业。遇吉有成，加四煞天刑，小产丶流产丶难产丶开刀，并主刑克。","父母宫":"贪狼於父母宫：双亲感情复杂，易有波折或意见分歧。主与父母缘分较浅，会克害父母。<br>◎因贪狼会照吉星，无刑克。<br>◎因贪狼庙旺，无刑克。<br>◎因与天喜同宫，主继室偏房所生，否则有刑克。","福德宫":"贪狼於福德宫：一生忙碌奔波，入庙无破，化吉会吉，为人享乐好吃喝，嗜酒或好赌博色欲，有艳遇。命宫有吉亦主贵主寿，寿达六十三以上，陷地加煞贫苦艰辛。贪狼化忌，有感情烦恼，与异性交住易滋生问题。红鸾丶天喜丶咸池丶天姚守照，为人风骚有桃花，喜与异性嬉乐。羊陀丶天刑丶大耗丶空劫守照，多烦恼纠纷，福薄不安。火铃同宫，虽能享福，但急躁，好投契。","交友宫":"贪狼於交友宫：交友广阔，富贵贫贱之友皆有，但知心少。多吃喝嫖赌的朋友，非善类，多与流氓黑社会有染。年轻时下属难招，不得力，而中晚年可吉。有左右魁钺科权禄吉星，受重视敬仰，得朋友下属欢迎拥护。加四煞空劫，朋友丶属下变化大，遭人暗算。会陀罗丶天姚丶阴煞丶大耗，酒肉之交。会空劫丶天月丶阴煞丶大耗，因友破财。","夫妻宫":"贪狼於夫妻宫：实非吉兆，主刑克或生离，男主妻迟可吉，早婚有克，加四煞生离；女主夫长，亦须迟婚方美。失陷遇煞男女皆三度。皆主配偶体态饱满，以迟婚或婚前恋爱数遇阻碍波折，或婚事曾遭破坏者为宜，否则克伤。羊陀火铃同宫或会照主离异。会照咸池天姚廉贞化忌者，主有桃色纠纷。","事业宫":"贪狼於事业宫：主人於交际应酬中成事业，如外交方面，营业方面，或创立娱乐方面等事业。(1)贪狼入财丶事业宫时，应戒之於贪。(2)入庙又见火丶铃时，对开创事业有独特之功力，可从事娱乐丶理容丶武职等挑战性行业，皆有发展，亦可掌权。(3)贪狼丶紫微允文允武。(4)贪狼落陷从官必贪，从事不发。(5)落陷又逢羊丶陀丶天空丶地劫，则全无发展馀地。","兄弟宫":"贪狼於兄弟宫：兄弟宜分居，久处必生嫌隙，且兄弟有异胞者。兄弟中有与父母意见不合者，多因不合而离家。","疾厄宫":"贪狼於疾厄宫：主肝胃不和，头昏气闷，或皮肤有白色癣。(1)防肝胆虚气，目眩气虚。(2)主因肾疾引发之心脏病，气冲肝而肝火旺。","田宅宫":"贪狼於田宅宫：(1)无祖业，早年田产少，如落陷更无。(2)入庙见火丶铃，可得祖产。但流年不时应防火灾。(3)贪狼见武曲丶化权丶化科晚年可自置产业。","身命宫":"贪狼於命宫：贪狼为第一桃花星：喜物质享受，男女之欢。入命的人多才多艺，能言善道。且嗜酒好赌，交际应酬手腕一流，人际关系良好，如往演艺界发展有利。个性八面玲珑丶好动圆滑丶欲望无穷丶精明灵活，应变能力强，具冲动性的感情，追求情欲不遗余力，喜欢投机丶冒险，新奇刺激的事物，也有过人的胆识，颇具赤子心，只论喜好不分是非。一生易有大幅度变化，以环境及感情居多。对六煞丶化忌有抵制力，能使其本身由嗜声色而转向才艺发挥。贪狼星外型中高身材以下；毛发浓黑，眉毛阔厚；眼黑多过白；颧高而不露；唇厚；予人有瞬眼艳之感觉。热心赚钱，不择手段，故不讲原则，无道义，好走捷径，欲念与日俱增，占有欲。善做作，有活力，面面俱圆，交际能力高。表面乐於助人，其实以自己利益为出发点。喜知人私隐，不喜他人洞悉自己。","财帛宫":"贪狼於财帛宫：(1)性质Ⅰ.擅於理财有钱财用途十分广泛现象。Ⅱ.不免因交际应酬而花费，但本质仍极为爱财，与天同本性正好相反。Ⅲ.进财时带有投机性丶变化性丶竞争性，并为异性财。(2)星化Ⅰ.会照红鸾丶天姚丶天喜丶咸池，沐浴及六煞丶化忌时，易因感情问题而破财。Ⅱ.与擎羊丶陀罗丶地空丶地劫同宫或会照，不能做投机生意，如股票丶赌博等，必有重大损失。Ⅲ.不怕化忌，於钱财上的损失，会较少。Ⅳ.喜贪狼丶武曲同宫，因二星皆主财，且武曲可制贪狼之恶，但二星皆为晚发格。"},"zhu":"1"},"铃星":{"explanation":"铃星：主夫妻关系多半不佳，口舌是非丶争吵丶冷战甚至离异，情况宜配合整体星性组合而定，负面影响较大。","zhu":"0"},"化忌":{"explanation":"化忌：会有是非丶管闲事丶困扰丶损失丶亏欠丶纠缠。自找痳烦，代表过程周折破绕，破秏。主遭遇灾祸","zhu":"0"},"咸池":{"explanation":"咸池星释义：暂无","zhu":"0"},"青龙":{"explanation":"青龙：形势大好。","zhu":"0"},"龙池":{"explanation":"龙池：美丽，艺术色彩；爱面子，清秀。","zhu":"0"},"丧门":{"explanation":"丧门星释义：暂无","zhu":"0"},"三台":{"explanation":"三台：吉助（职位）。","zhu":"0"},"恩光":{"explanation":"恩光：有肋力，形势好，有裨益。","zhu":"0"},"华盖":{"explanation":"华盖：宗教，神怪，兼见贯索，刑忌，流年华盖坐命主官司。","zhu":"0"},"晦气":{"explanation":"晦气星释义：暂无","zhu":"0"},"天梁":{"explanation":{"迁移宫":"天梁於迁移宫：出外主得贵人扶助，为人倚重。有贵人，均为年长者。","子女宫":"天梁於兄弟宫：兄弟姊妹人少较亲。兄弟长幼有序。","父母宫":"天梁於父母宫：双亲善良又长寿，并与双亲同住受其福荫。父母为活泼健郎，有责任心，心地善良之人。","福德宫":"天梁於福德宫： 重清闲，人生悠游，并能得祖上福荫，长辈之关怀。","交友宫":"天梁於交友宫：一般朋友未几，得力，遇众吉交会尤吉。陷地欠力，有亦如无。会左右魁钺科权禄，得正直之友，助力大，并得下属拥护。加四煞丶空劫，因友损财，多纠纷长短，遭背弃算计。","夫妻宫":"天梁於夫妻宫：天梁入夫妻宫经济权於配偶，能尊重配偶，男贤妻，喜掌权，女夫是管家郎。天梁入夫妻宫，婚前不论解除婚约或阻力，或延误婚期等困难，皆能化解。婚後，如配偶事业受挫，身体健康不佳，意气用事，环境变化，只要无煞星同宫，亦皆能化解。天梁入夫妻宫，男命娶贤妻，善理家务，有独撑家庭之能力，若头班妇女则偏文职工作。女命配偶是管家郎，喜干涉家务。","事业宫":"天梁(1)行政长才，允文允武，且事业稳定。(2)天梁天同能独当一面。天梁天机位高权重。","兄弟宫":"天梁於兄弟宫：吉众助力亦少。兄弟正直磊落，入庙情深，见辅弼魁钺，五人。无辅弼，有异心。陷地主孤，或各方。平闲或见红鸾天喜，只得姊妹。加四煞主克丶不和或有刑讼。加空劫死绝孤单，无兄弟。","疾厄宫":"天梁於疾厄宫：无明显特徵，若有病灾，亦多转危为安。主肠胃不调，消化不良等症。有时有用脑过度，或胃气而已。","田宅宫":"天梁於田宅宫：天梁星为荫庇之星曜，临田宅宫主得祖业遗产。(1)有祖业，老旧古厝，大房子或四合院。(2)天梁天同购屋先难後易。","身命宫":"天梁於命宫：天梁为荫星，一般指称能获得父执长辈之荫助，亦有长者风范，所以作风老成；而为刑星时，则有逢凶化吉之象，或是遇难呈祥之作用，则意谓会遭遇灾厄困顿或官讼是非，而後发挥解厄之能量，天梁星也可当成医药星丶法律星丶刑克之星。天梁星之人兴趣广范，喜近宗教，举止庄重，有老大风范，喜受尊敬，这也是天梁星之特质，天梁星之人也好言谈表达，故人缘好，多结忘年交。天梁是福星，故常有下列机会∶如得祖上遗产丶代理名牌产品丶享受他人现成事业丶继承某种现成事务。但天梁不利经商。天梁为中等身材，面长，唇薄，无骨感但颧高，无骨感，眉毛浓黑，清秀，膏红齿白（英俊），眼圆大。外相正义，稳重。以救世者自居，视恶如仇，三思而後行。逢凶化吉（先凶後吉）。","财帛宫":"天梁於财帛宫：天梁乃清高之星，并不主财。凡天梁入财帛，多在公家机关任职而领取薪金，得财并不艰难。但其人必重名甚于重利，故常有为人作嫁的情形出现，甚至常为他人之事而奔波耗财，在财运上有名无实，最劣者还会将送上来的财运拒之门外。若庙旺财帛富足，与禄存丶化禄丶太阴同宫会照，主大富，遇科权左右昌曲吉星尤美，主大富和大贵。陷地则辛勤刻苦足以渡日。"},"zhu":"1"},"旬空":{"explanation":"旬空：到底成空。","zhu":"0"},"地劫":{"explanation":"地劫：指物质上破秏。有破财的可能。","zhu":"0"},"飞廉":{"explanation":"飞廉：破坏，飞来是非。","zhu":"0"},"吊客":{"explanation":"吊客星释义：暂无","zhu":"0"},"天煞":{"explanation":"天煞星释义：暂无","zhu":"0"},"喜神":{"explanation":"喜神：形势祥和。","zhu":"0"},"天贵":{"explanation":"天贵：有肋力，形势好，有裨益。","zhu":"0"},"天魁":{"explanation":"天魁：属於阳贵人，也就是说它的贵助是显而易见的，你可以直接感受得到的帮助。有发展机会，遭遇困难也能逢凶化吉。","zhu":"0"},"蜚廉":{"explanation":"蜚廉星释义：暂无","zhu":"0"},"天哭":{"explanation":"天哭：感情上打扰，损秏。","zhu":"0"},"解神":{"explanation":"解神：分解，一分为二，解神见天马即离婚。","zhu":"0"},"指背":{"explanation":"指背星释义：暂无","zhu":"0"},"大耗":{"explanation":"大耗：损失。如失窃破财。","zhu":"0"},"龙德":{"explanation":"龙德星释义：暂无","zhu":"0"},"廉贞":{"explanation":{"迁移宫":"廉贞於迁移宫：不宜坐守旧地，以出门为利。吉星会，出外吉祥，凶星照，定倾危，劳碌，好动，但有时亦疏懒。多奇遇，宜往都市发展，闲时喜登山郊游。","子女宫":"廉贞於子女宫：(1)性烈枭雄，有叛逆性，破坏性，研究心，常将玩具打开分解，注意电器用品，小心安全。(2)廉贞与贪狼丶七杀丶破军(杀丶破丶野狼任何一星)同宫，主孤克，再加六煞，则全无子望。(3)独坐主子女一人。廉贞丶天相有二子。廉贞丶天府子三人。","父母宫":"廉贞於父母宫：父母性情怪异难捉摸，易对子发脾气，故父子缘弱。","福德宫":"廉贞於福德宫：劳心劳碌，化忌时有心结，但患难时能拯危急。廉贞入庙，与天府丶天相会照者，多福多寿，快乐享受之命。","交友宫":"廉贞於交友宫：入庙，多受异性助力。交友广阔，众多而得力，但变化大，知心者少，每易结交损友。陷地遭背弃有害，晚年方得。会照吉星丶禄存或化禄：因友得财。化忌加煞，受朋友拖累。会四煞空劫天刑大耗，因友损财破耗，或被陷害，或受刑讼丶牢狱之灾。","夫妻宫":"廉贞於夫妻宫：爱情不美满之征兆，恋爱较早，配偶性刚，易走极端，夫妇不睦。纵不加煞，也主夫妇情薄，或为怨偶，男克妻另娶，女克夫再嫁，加四煞化忌刑克尤凶，喜入水宫并与水曜同值得拱照灾轻。廉贞化禄，固然夫妇恩受，感情炽烈，但防本人有艳遇。廉贞化忌，不但会离婚，而且与异性还有不少感情纠葛。","事业宫":"廉贞於事业宫：廉贞为官禄主，入官禄宫皆有掌权的机会。不遇煞星，其人重工作效率，可发挥卓越统率能力，适任主管之职。遇羊陀空劫，事业不顺，长短不中断，百事难成。陷地加煞，功名无份，须防官非。廉贞化忌与七杀丶四煞丶天刑同在官禄宫，有牢狱之灾丶政治迫害。","兄弟宫":"廉贞於兄弟宫：庙旺兄弟成名，得力，有依靠。闲陷互克，加众吉亦有一者欠和。天府同，缘厚有助。贪狼同，兄弟各方，缘薄。天相同，兄弟成名，有助，仍欠和。七杀同，胆大，身体不佳，有助，欠和。破军同，性暴，兄弟不睦，缘薄。见四煞劫空天刑，刑克病伤。见左右昌曲魁钺，有助，有一欠和。","疾厄宫":"廉贞於疾厄宫：主阴分虚亏丶肝阳上升丶流行性感冒丶贫血丶失眠丶咯血丶手淫丶意淫丶遗精。女子经期不准丶经血不足。 淋病及梅毒等症。 心火燥急。","田宅宫":"廉贞於田宅宫：祖业有破，且难有其份。入庙可自置家产，陷地无祖业，自置亦艰难，甚至无田宅。加四煞晚置而复去，并因产业而生灾祸。其人住所靠近树木丶土坡，加煞，家中电器易生故障。","身命宫":"廉贞於身命宫：暂无","财帛宫":"廉贞於财帛宫：凡廉贞入财帛，颇多耗费，易惹词讼破财，或被人侵吞偷盗，尤与辅弼同宫，易遭偷盗之事。"},"zhu":"1"},"力士":{"explanation":"力士：好助力。","zhu":"0"},"八座":{"explanation":"八座：吉助（职位）。","zhu":"0"},"天钺":{"explanation":"天钺：属於阴贵人，它的助力来得也许不明显，但你可以直接感受得到的帮助。有发展机会，遭遇困难也能逢凶化吉。","zhu":"0"},"岁建":{"explanation":"岁建：逢吉增吉，逢凶增凶。","zhu":"0"},"凤阁":{"explanation":"凤阁：凤阁入夫妻宫主配偶较讲究情调，精神面需求较高。","zhu":"0"},"寡宿":{"explanation":"寡宿：寡宿居夫妻主一生中易有一段时间因感情不合或工作关系，而与配偶分房或分居。","zhu":"0"},"天机":{"explanation":{"迁移宫":"天机於迁移宫：暂无","子女宫":"天机於子女宫：主子女不多，庙旺有二人，活泼丶聪明丶好动。","父母宫":"天机於父母宫：父母为和蔼可亲，平易近人，对子女养育呵护倍至之人。主远离父母，否则有刑克。父母思想高，管教子女严格，庙旺无刑克。<br>◎因天梁会照，可免刑克。","福德宫":"天机於福德宫：喜思考丶求知欲高丶好奇心重，追求精神层次发展。","交友宫":"天机於交友宫：暂无","夫妻宫":"天机於夫妻宫：(1)配偶感情纤细，有文艺才华。(2)配偶年龄相差较大，略带神经质。(3)此星浮动丶择偶时会不够慎重，简单仪式或小变化(情绪性变化)。如分居会再复合，口舌亦难免。天机入夫妻宫配偶较劳碌，因天机主家务事，是以天机居女命宫丶福德，常会为家务事而忙碌。夫妻多是非争执丶口舌亦多，天机逢擎羊则不利配偶。夫妻之生活方式宜聚少离多，感情会比好。配偶年龄差距较大，男得贤妻，个性刚烈，女配夫必有学术专长。","事业宫":"天机於事业宫：天机星临事业宫，一生事业多变化。适合技术性之人员，靠脑力丶动手脚的工作都很适合，如艺术丶出版丶设计丶筹划丶参谋丶木器丶装潢皆可。","兄弟宫":"天机於兄弟宫：暂无","疾厄宫":"天机於疾厄宫：暂无","田宅宫":"天机於田宅宫：太阳星是一个浮动的星曜，所以於田宅宫也有浮动的意义，祖传的产业，便有退去的趋势，入庙有吉星扶持者，仍不免以有浮动变换的事实推论。(1)不依祖业，自行创置，宜住圆环旁丶马路边。(2)会常搬家或摆设常变，天机化忌家中常有吵闹。","身命宫":"天机於身命宫：暂无","财帛宫":"天机於财帛宫：(1)钱财波动Ⅰ白手成家，劳心劳力於千辛万苦中挣钱，且财易波动，财来财去。Ⅱ如逢六煞丶化忌，应防负债及官司。(2)头班性质Ⅰ不定∶一生中难以一种固定头班进财，或屡换工作或兼差。Ⅱ投机∶喜以具有投机性丶冒险性的行业进财。Ⅲ种类∶擅运用技巧赚钱，尤其如代理丶仲介丶贸易，并适合短期投资的现金生意。(3)大限变化Ⅰ见六吉丶化禄丶禄存则能增加收入机会。Ⅱ见化忌丶六煞，则财源终止或减少收入，故不宜经商。"},"zhu":"1"},"紫微":{"explanation":{"迁移宫":"紫微於迁移宫：暂无","子女宫":"紫微星於子女宫：(1)先得女，子女优秀。(2)庙旺有三男二女，落陷加煞星子女有二人。(3)独坐加地空丶地劫表孤君无子。","父母宫":"紫微於父母宫：暂无","福德宫":"紫微於福德宫：福根极厚，能享受崇高富贵之乐。得贵人相扶持，尤其是年长或高阶人士之帮助。本身也热心公益，但内心空虚。<br>◎因与天府同宫，终身福厚。","交友宫":"紫微於交友宫：於人际关系中，交往层面高，入庙有吉星辅曜会照，主得宽厚诚实之友，并得下属之拥护。如紫微破军主先欠佳後吉利，又如紫微落陷加天空丶地劫，主朋友易分离。","夫妻宫":"紫微星於夫妻宫：配偶贤德，有责任感，统治欲，但含有孤意，即自己会有被压制的感觉。男命尊重太太，女命能因夫得贵。紫微入夫妻宫选择配偶眼光较高，故不宜早婚。","事业宫":"紫微於事业宫：(1)一生事业得平步青云，因此星於官禄宫得位。(2)紫微天府名利双收。(3)紫微天相为官清贵。(4)紫微破军辛劳有成，如为武藉更为有利。(5)紫微七杀可为将官命格，或黑道老大。(6)行业以学人丶工程师丶公教政界丶企企业所有人管皆可。","兄弟宫":"紫微於兄弟宫：暂无","疾厄宫":"紫微於疾厄宫：暂无","田宅宫":"紫微於田宅宫：暂无","身命宫":"紫微於身命宫：暂无","财帛宫":"紫微於财帛宫：暂无"},"zhu":"1"},"伏兵":{"explanation":"伏兵：隐藏之患。","zhu":"0"},"天官":{"explanation":"天官：有贵人帮助，但助力比天魁天钺低些。","zhu":"0"},"擎羊":{"explanation":"擎羊：主不和丶刑克丶分离丶纠纷等事情。另须注意身体受到意外伤害，如开刀，破相等事情发生。","zhu":"0"},"小耗":{"explanation":"小耗：小损失。","zhu":"0"},"天使":{"explanation":"天使星释义：暂无","zhu":"0"},"官府":{"explanation":"官府：法律讼事或与人发生争执。","zhu":"0"},"将星":{"explanation":"将星星释义：暂无","zhu":"0"},"白虎":{"explanation":"白虎星释义：暂无","zhu":"0"},"天喜":{"explanation":"天喜：桃花运。有认识异性机会或有婚事喜讯。","zhu":"0"},"天月":{"explanation":"天月：医药，疾病，诟病，怪癖，遭受诟病或恶性诋毁。","zhu":"0"},"岁驿":{"explanation":"岁驿星释义：暂无","zhu":"0"},"天厨":{"explanation":"天厨星释义：暂无","zhu":"0"},"巨门":{"explanation":{"迁移宫":"巨门於迁移宫：暂无","子女宫":"巨门於子女宫：(1)子女爱说话，与父母见面少，并防思想相背。(2)主有损，入庙旺先难後有二人。巨门丶太阳主长丶次子女，较易扶养。巨门丶天机仅一子，得吉星有二子。巨门丶天空丶地劫丶恐无子。","父母宫":"巨门於父母宫：双亲重视物质生活，对子女要求苛刻，父母当中有一人会刑克。必须过继出祀，否则危害刑伤。","福德宫":"巨门於福德宫：主人劳心劳力，费精费神。如化忌则更钻牛角尖，巨门天同乃唯一可享福宫位。","交友宫":"巨门於交友宫：朋友三教九流都有。巨门丶天机部属不忠。加化忌朋友多牵累。巨门若入庙，主交友虽多口舌之争，但多创业多谋之友，或有真率好辩丶勤力多才的职员。","夫妻宫":"巨门於夫妻宫：巨门入夫妻宫夫妻占有欲强，常易因嫉妒生口角，故年龄差距宜大。男喜妻华丽型，女喜夫富家子。巨门於夫妻宫，主配偶口才好。夫妻双方命宫，夫妻宫丶福德宫，如能配合，且多从事以口为行业者，或是於是非较多的机构工作，则反而能减少夫妻间之磨擦及争执。巨门感情复杂，移情别恋严重，婚前波折。男有感情波折。","事业宫":"巨门於事业宫：以口才或学术，技术交通为业。若巨门庙临事业宫，主创业，或由专门技能发展，或为医师丶法律家丶政治家丶军事家，以及星相艺术上发展，或为帮会领袖丶宗教宗主，以超人的头脑丶灵辩的口才上得成功。如加煞，则刑讼不止。","兄弟宫":"巨门於兄弟宫：兄弟间意见分歧难沟通。兄弟姊妹感情不甚融洽。","疾厄宫":"巨门於疾厄宫：暂无","田宅宫":"巨门於田宅宫：(1)入庙坐子丶午宫有置产机会，否则无。(2)家中多吵杂，邻居多是非。(3)巨门坐田宅，交友宫干为丁者，常遭小偷，若行运逢之，主该年限遭窃。","身命宫":"巨门於命宫：巨门特色为人未到声先到，先声夺人。是非之星。身材圆滚，短少。单眼皮，线状眉，毛发浅薄，形貌陋朴，面有颧骨，鼻挺口大，眼生威角，手脚强硬，声音宏亮，性疑寡合 。巨门星主导着是非丶猜疑而擅长研究丶分析。巨门星坐命者心胸并不开朗，会有隐晦不明之处，持着怀疑的态度，所以能够沉稳下来作研究分析，也因为剖析能力强，所以常能有精辟独到的见解，而所着重点，往往过於偏向负面丶消极或灰色面，即使趋向事实，也难为人们所接受，因为其中会有以偏盖全的偏颇见解，所以於高论之後，便可能引起反驳丶争论，这也是巨门星会引起口舌是非之原因之一。巨门星因多疑，故善研究丶联想丶推理丶分析丶筹划，且充满自信，也善於察言观色，回应极佳，只是言谈不免偏向刻薄，所以常不为人所喜，只因为有点傲气，不满现实，但凡事皆能看得比一般人深入，所以亦有心机深沉之现象，其实，巨门星不失为心地善良之人，只是疑心多，易引起反感！巨门虽凶，唯紫微丶禄存能解其厄。子午丶巨门坐命宫，对宫有禄存来会，则为外交人才。","财帛宫":"巨门於财帛宫：(1)以「口」生财Ⅰ.以口及运用劳心工作而进财，如代理仲介，智能凝聚等模式，可白手成家。Ⅱ.财较难积存，欲望过大，有横破。Ⅲ.忌锋芒外露，防寻事生非。Ⅳ.如子女宫不吉者，防子女败家。(2)星化Ⅰ.巨门化忌，巨门擎羊，巨门陀罗∶防口舌官非。Ⅱ.巨门天同∶利江湖型人物。"},"zhu":"1"},"左辅":{"explanation":"左辅∶强力帮助主星的力量，压制凶星，展现让你如意。","zhu":"0"},"奏书":{"explanation":"奏书：上诉，化禄见禄为上诉得直，奖赏，聘书。","zhu":"0"},"攀鞍":{"explanation":"攀鞍星释义：暂无","zhu":"0"},"阴煞":{"explanation":"阴煞：灵觉高。","zhu":"0"},"武曲":{"explanation":{"迁移宫":"武曲於迁移宫：(1)武曲会吉星，如禄马交驰则为巨商之格。(2)武曲主动，主变动，於外劳心，不能静守。(3)会野狼可成功，会七杀身心不平静。","子女宫":"武曲於子女宫：暂无","父母宫":"武曲於父母宫：父母个性稳定，行事谨慎，对子女关怀倍至。因入庙有吉星会照，可免过继或离居。","福德宫":"武曲於福德宫：暂无","交友宫":"武曲於交友宫：为寡宿丶变动之星，故交友来去皆快。武曲破军友人多变，武曲与七杀丶贪狼同宫交友不佳。","夫妻宫":"武曲入夫妻宫晚婚为宜，生活平淡较无气氛。武曲入夫妻宫男命娶妻个性刚烈，独立性强，不喜串门子，女命孤独晚婚，配夫个性较暴燥，较独断独行。男命武曲入夫妻时，妻有男子之志，事必躬亲，女中豪杰，但性躁独断。命宫如不吉，夫妻宫又逢武曲加煞，一生中往往有数次婚姻，故宜晚婚。<br>◎因武曲於辰丶戌丶丑丶未宫 ，配偶内向。<br>◎因武曲逢擎羊丶陀罗丶化忌丶火星丶易生离死别。<br>◎因武曲化权∶配偶为武贵。","事业宫":"武曲於事业宫：暂无","兄弟宫":"武曲於兄弟宫：暂无","疾厄宫":"武曲於疾厄宫：主幼年多灾病，四肢或头脸受创。(1)武曲属阴金，主肺经咳嗽，音沙哑丶气结丶肝旺，易感冒。(2)会文曲化忌鼻蓄脓，伤肺。(3)会羊刃化忌有刀伤。且武曲於疾厄宫，幼年多灾难，四肢有刑伤，头面防破相。","田宅宫":"武曲於田宅宫：暂无","身命宫":"武曲於身命宫：暂无","财帛宫":"武曲於财帛宫：暂无"},"zhu":"1"},"月德":{"explanation":"月德星释义：暂无","zhu":"0"},"亡神":{"explanation":"亡神星释义：暂无","zhu":"0"},"天德":{"explanation":"天德星释义：暂无","zhu":"0"},"天马":{"explanation":"天马：驿马丶变动。","zhu":"0"},"文昌":{"explanation":"文昌：文学丶科甲丶学识丶美貌丶桃花。智慧之星。利於参加考试或从事学术研究活动。","zhu":"0"},"禄存":{"explanation":"禄存：禄存表示有财禄丶有贵人帮助。也可表示有解厄丶聪明丶上进丶耐劳等现象。","zhu":"0"},"天才":{"explanation":"天才星释义：暂无","zhu":"0"},"破碎":{"explanation":"破碎：较少之损失。","zhu":"0"},"博士":{"explanation":"博士：聪明。","zhu":"0"},"台辅":{"explanation":"台辅：偷窃性质丶声望丶台阁之星。","zhu":"0"},"红鸾":{"explanation":"红鸾：主桃花运。有认识异性机会或有喜讯。一般指追逐爱情开始。","zhu":"0"},"息神":{"explanation":"息神星释义：暂无","zhu":"0"},"月煞":{"explanation":"月煞星释义：暂无","zhu":"0"},"天姚":{"explanation":"天姚：风情万种，不拘小节。","zhu":"0"},"天巫":{"explanation":"天巫：神怪，遗产，灵界物，媒介物，有人介绍，积聚，收集性质。","zhu":"0"},"太阴":{"explanation":{"迁移宫":"太阴於迁移宫：不喜与人争斗。於外有女性缘，多得女性之助。出外常晚归，另喜夜游。","子女宫":"太阴於子女宫：暂无","父母宫":"太阴於父母宫：太阴坐父母宫，大都有刑克父母现象，否则其人必定弃祖过房，或远离独立，才无刑克。","福德宫":"太阴於福德宫： 主福厚能享受。有异性缘(尤指女性缘)，思想浪漫，精神层次高，男命旺守，一生享福。","交友宫":"太阴於交友宫：暂无","夫妻宫":"太阴於夫妻宫：暂无","事业宫":"太阴於事业宫：暂无","兄弟宫":"太阴於兄弟宫：兄弟姊妹缘分深厚。","疾厄宫":"太阴於疾厄宫：主阴汾虚弱丶阴亏丶 泻痢丶膨胀丶脚肿丶湿气。 脾胃丶小肠湿热丶阻滞等症。(1)属阴水，主肾及血液。(2)男命防肾亏，女命防赤白带，子宫疾病。(3)失辉易形成目疾丶疝气丶糖尿病。(4)太阴丶羊刃目疾。太阴丶陀罗牙齿不好。太阴会天空丶地劫有疯疾。太阴天同加四煞，病症多端。太阴入命身，又见恶煞交冲，作伤残之论。","田宅宫":"太阴於田宅宫：太阴入庙会吉星，可置产业丶农场，以树木丶花果为利。太阴为田宅主，不动产多。(2)喜光线微暗之房间，家里整理很乾净，又爱晚睡。附近有低洼丶水丶井丶泉丶林园，即湿气稍重。(3)星化Ⅰ.太阴丶天同∶白手成家。Ⅱ.太阴丶太阳∶主「日月合壁」，不动产很多。Ⅲ.太阴丶天机∶可自置，但田宅之购置会离出生地较远。","身命宫":"太阴於命宫：(1)刑克∶刑克阴性近亲，主要为亲情不足或长期健康不佳。(2)头班∶易接近清高工作，如研究丶学术丶考试丶文艺丶公职等。(3)疾病∶无论於命宫或疾厄宫，均主易犯与泌尿有关疾病。(4)宫位 庙旺宫位能伸能守，有利公职丶文化艺术，落陷宫位开运迟或力不从心，就业保守反而能维持和祥，太过竞争性的不适合。太阴外型修长偏瘦，清秀，眼细，毛发浅薄。好整洁；不管他人是非，但求自保；喜稳定，审傎。<br>◎因太阴於子，与天同星同宫，天同主福，太阴主富，如能加吉星自是富贵，女命不宜加煞及又逢桃花星，则美中不足。男命亦主风流倜傥。温柔有个性，性情开朗而性急，待人接物有礼八面玲珑，心情稳定，喜过悠闲生活，心地慈善，品格清高有才能，擅策划有分析能力，有绝艺，常有各种构想及计划，惜实现少。","财帛宫":"太阴於财帛宫：暂无"},"zhu":"1"},"太阳":{"explanation":{"迁移宫":"太阳於迁移宫：太阳星主动，属内外不宜静守，出门近贵能发。阳光照四方岂能静守，宜远离家乡去发展。","子女宫":"太阳於父母宫：父母心地善良，为人忠厚。太阳坐父母宫，大都有刑克父母现象，否则其人必定弃祖过房，或远离独立，才无刑克","父母宫":"太阳於父母宫：暂无","福德宫":"太阳於福德宫：多贵人扶持，生活充满活力，女命更有旺夫命。<br>◎因太阳庙旺，故财源极旺，但太阳为放射的光热，为动星，故喜动不喜静，为忙中有福。<br>◎因与巨门同宫，费心欠安。","交友宫":"太阳於交友宫：暂无","夫妻宫":"太阳於夫妻宫：暂无","事业宫":"太阳於事业宫：暂无","兄弟宫":"太阳於兄弟宫：兄弟虽是如手足，分家各自置田产。<br>◎因巨门同度或会照，有吉星，弟兄都是创立事业者。<br>◎因太阳陷，兄弟成就低，或弟兄多争不和，少依靠。","疾厄宫":"太阳於疾厄宫：主人血压高丶头眩丶双目昏花，或目中有红筋，肝阳上升丶头痛丶大肠乾燥丶痔疮便血丶心火极重。(1)阳火，主心火，肝火旺，心燥急，阳明之疾，有痔漏。(2)旺守，高血压，脑溢血。(3)失辉目疾，如见化忌又逢煞有失明之虞。","田宅宫":"太阳於田宅宫：暂无","身命宫":"太阳於命宫：太阳能发光发热，因此光华夺目，故於人生中主声名与显贵，除非与财富的星曜会合，否则主‘贵’不主‘富’。太阳代表光明丶博爱丶躁急丶积极丶主动丶好公益济施丶讲究排场，好面子及体面。若太阳星坐命於旺宫，男命∶性情豪爽丶乐善好施丶志气高傲丶聪明机警；若坐於陷宫，作事有头无尾丶持续力不足，先勤後惰，求学不求甚解，也有华而不实之意涵。若太阳星坐命於旺宫，女性∶性格贞烈豪爽，有男子气概，多聪明慈祥丶福大量宽；若坐於陷宫，情急劳心丶多进多退丶辛勤多劳，常见五分钟热度。刑克阳性近亲。女命对配偶时有埋怨及挑剔。易接近清高工作，如研究学术丶考试丶文艺丶公职等。易患眼疾丶脑神经衰弱丶心脏丶血压丶糖尿等疾病。体格雄壮，相貌方圆。外型壮健平均，中高；小骨感，国面不起菱；眉浓黑。不会害人，大公无私；光明正大，无隐藏；爽朗，不拘小节；肯自我牺牲，助人心强，亦不会虎头蛇尾，人缘好；但因太热心助人，令人烦厌。","财帛宫":"太阳於财帛宫：(1)入庙Ⅰ.出手大方，不重金钱，重物质享受，重名轻利。Ⅱ.易得显贵之财，如着作丶竞赛丶赠予，知名度而进财。Ⅲ.太阳非财帛主，故仅表现善於理财，对他人钱财一丝不苟，却不重己财，博爱之故。(2)落陷进财辛苦费力，财来财去，如会截空丶地空丶地劫是无财库的。(3)白手成家∶除非与天梁同宫，否则均靠自己成家努力致富。"},"zhu":"1"},"官符":{"explanation":"官符星释义：暂无","zhu":"0"},"天同":{"explanation":{"迁移宫":"天同於迁移宫：主出门得福。於外口福好，外食机会多，有贵人相助。","子女宫":"天同於子女宫：(1)子女乖巧丶倚赖丶顽皮。(2)入庙有五子天同丶巨门有二人。天同太阴有五人。天同天梁加吉星有三人。","父母宫":"天同於父母宫：暂无","福德宫":"天同於福德宫：暂无","交友宫":"天同於交友宫：人际关系好，与部属关系融洽。天同星临交友宫，交多方面的朋友，入庙得朋友协助。","夫妻宫":"天同於夫妻宫：男命得贤内助，配偶聪明容貌美丽，女命得夫温柔体贴，感情和睦。但天同星主中年易变化挫折，夫妻间之变化，易有下列情况∶1.生离死别。2.因工作而夫妻异地而居。3.夫妻有一人生病。4.自己事业失败。5.外遇而影响感情。","事业宫":"天同於事业宫：宜白手创业，或由小发大。(1)应从事公职服务人员最适合。(2)工作应为清高类者适合，如文化丶娱乐丶服务及协调者。","兄弟宫":"天同於兄弟宫：兄弟间融洽和睦，有兄弟为谦虚温和易相处之人。","疾厄宫":"天同於疾厄宫：暂无","田宅宫":"天同於田宅宫：暂无","身命宫":"天同於命宫：天同星能化气为福，但福并不是与生俱来丶自天而降，而是经过一番磨练丶挫折之後才得安定与享受。天同有先贫後富丶先无後有的现象，所以天同星坐命者往往亦象徵着於事业丶心情丶心灵上会经过一番折腾及磨练。天同一般都有口福，也重物质享受。天同属於‘弱势’丶‘神经质’加‘浪费’的综合体，天同是为情绪星，如果没能构筑好生活的着力点，就容易出现情绪性的孤寂感；因为天同的价值观丶品味丶美感经验及感受力强，所以於姻缘路上容易遭遇坎坷或步入崎岖不平之路。天同的另一特质则是能於逆境中找到自得其乐的方法及兴趣丶嗜好。天同特色为：(1)喜悠闲丶平淡生活，重精神丶物质享受，若会昌曲有文学天赋。(2)会使合伙之股东难以习惯。天同外型丰润。眉清目秀：月型眉丶线型眼丶凤眼丶双眼皮。中高，比巨门高少许。因与人无争，故多助力，以致多褔。人缘好，懂享受。平稳而成。","财帛宫":"天同於财帛宫：暂无"},"zhu":"1"},"截空":{"explanation":"截空星释义：暂无","zhu":"0"},"孤辰":{"explanation":"孤辰：个性孤僻。","zhu":"0"},"地空":{"explanation":"地空：指精神上破秏。於感情上可能有不利的影响。","zhu":"0"},"天相":{"explanation":{"迁移宫":"天相於迁移宫：人缘好，到处受欢迎，常有人跟随左右。","子女宫":"天相於子女宫：(1)子女敦浓丶诚实丶爱吃。(2)天相独坐有2子。天相武曲有3子。紫微天相加吉有3丶4人。","父母宫":"天相於父母宫：拥有明理丶应变的父母，并且从父母的教导中，得到一些为人处世的技巧，受父母影响很大。双亲开明，多社交活动，为公道伯。","福德宫":"天相於福德宫：重物质享受，美衣美食。紫微天相主福祉。天相太阳福寿全。天相天机人心劳。","交友宫":"天相於交友宫：(1)朋友群皆好衣食，大多同龄者。(2)天相廉贞加六煞，主近身者背逆。","夫妻宫":"天相於夫妻宫：天相入夫妻宫男得美妻，乖巧丶贤慧丶气侃。女命天相入夫妻宫，丈夫处事积极，责任心重。天相於夫妻，易与原先认识的亲友丶同事丶邻居等对象结婚，有亲上加亲之象。天相入夫妻宫，配偶谨言慎行，配偶又有家庭责任，爱家居生活，热情诚恳，即具有理性及包容性。","事业宫":"天相於事业宫：暂无","兄弟宫":"天相於兄弟宫：暂无","疾厄宫":"天相於疾厄宫：暂无","田宅宫":"天相於田宅宫：(1)有祖产。(2)天相加煞，防产权状及文书上之麻烦。(3)天相紫微，田产自购。天相武曲，不只一宅。天相廉贞加煞防祖业飘零。","身命宫":"天相於命宫：天相星司爵禄，化气为印，长相敦浓丶淑雅。天相星之地位犹如宰相，贵显丶允文允武，但较偏向文韬；俊师丶端庄丶有威仪，注重外表颜面，因为是为福善之星，所以其人常面带微笑，待人和气。天相星做事坚持自己的原则，有责任心，并有为人排解困难的天赋潜能。天相外型中高偏长，国字面型，眉毛密。个性较人内向，老实。被动无主见，纯真，强而不悍，易信他人。天相星於命宫，聪颖丶表现杰出丶有口福，崇尚美食丶华衣，注重仪表，喜欢小零食，也有成为老饕者。天相适合於成熟型或较大型公司行号任职，甚至政府机关服务，则能突显个人之能力，也较能发挥所长。一般天相星坐命者，感情婚姻波折度大，容易於上流社会打滚！天相为人乐观进取，尽忠职守，举止优雅稳重，有恻隐之心，於感情方面容易冲动及感动。天相星坐命者，易因表现优异而获上司长官信任，也能获部属拥戴。","财帛宫":"天相於财帛宫：暂无"},"zhu":"1"},"将军":{"explanation":"将军：形势急而好。","zhu":"0"},"劫煞":{"explanation":"劫煞星释义：暂无","zhu":"0"},"贯索":{"explanation":"贯索星释义：暂无","zhu":"0"},"陀罗":{"explanation":"陀罗：於运势的发展上有阻力，愿望达成较难，且影响深远。","zhu":"0"},"火星":{"explanation":"火星：有事情急剧变化，不利於事情进展。应提防是非及精神上面临纷扰，不愉快。","zhu":"0"},"封诰":{"explanation":"封诰：利考试，地位,封赠，封章之星。","zhu":"0"},"天刑":{"explanation":"天刑：自律，受控制。会见化忌或凶星，反会失控，助纣为虐。主刑克丶孤单或分离。","zhu":"0"},"天府":{"explanation":{"迁移宫":"天府於迁移宫：主出行得福，於外遇贵人。宜外出谋财，并於外喜助人，也喜计较。如与武曲丶廉贞同宫，主能於波动中得财。","子女宫":"天府於子女宫：(1)子女有向心力丶活泼丶孝顺，能光耀家门。(2)紫微丶天府五人。天府廉贞有三人。天府六煞亦有三人。","父母宫":"天府於父母宫：父母慈祥，亲情融洽，但助力较少。","福德宫":"天府於福德宫：知足常乐。主福厚。","交友宫":"天府於交友宫：主交友广阔。有地位丶福分，故交往阶层多为头家及主管。","夫妻宫":"天府於夫妻宫：天府入夫妻宫男命妻子能干，尊重太太，老婆理财能力强，上班族，持家有道。天府入夫妻，较重精神享受。配偶能力强，擅理财，且妻为头班妇女为佳。天府入夫妻宫，感情关系深浓，夫唱妇随，有时配偶有工作能力丶抱负丶远见，但亦能为家庭放弃个人理想。夫妻间有相似处的家世，目标丶理想丶嗜好丶能力丶头班等项目。天府入夫妻宫，有时有亲上加亲。如亲戚关系丶同事丶同学丶邻居或家居不远丶昔日旧识朋友，或久别重逢而论及婚嫁。","事业宫":"天府於事业宫：暂无","兄弟宫":"天府於兄弟宫：兄弟众多，兄弟间有人服公职，父母稍偏倚兄弟。","疾厄宫":"天府於疾厄宫：暂无","田宅宫":"天府於田宅宫：暂无","身命宫":"天府於身命宫：暂无","财帛宫":"天府於财帛宫：暂无"},"zhu":"1"},"天寿":{"explanation":"天寿星释义：暂无","zhu":"0"},"病符":{"explanation":"病符：注意小病。","zhu":"0"},"天伤":{"explanation":"天伤星释义：暂无","zhu":"0"},"文曲":{"explanation":"文曲：文艺丶学识丶美貌丶桃花。智慧之星。利於参加考试或从事学术研究活动。","zhu":"0"}}