var obj = {
  "天空": {
    "explanation": "天空星释义：暂无\n", 
    "zhu": 0
  }, 
  "右弼": {
    "explanation": "右弼星释义：暂无\n", 
    "zhu": 0
  }, 
  "破军": {
    "explanation": {
      "迁移宫": "破军星位于迁移宫：暂无\n", 
      "子女宫": "破军星位于子女宫：暂无\n", 
      "父母宫": "破军星位于父母宫：暂无\n", 
      "福德宫": "破军星位于福德宫：暂无\n", 
      "仆役宫": "破军星位于仆役宫：暂无\n", 
      "夫妻宫": "破军星位于夫妻宫：暂无\n", 
      "官禄宫": "破军星位于官禄宫：暂无\n", 
      "兄弟宫": "破军星位于兄弟宫：暂无\n", 
      "疾厄宫": "破军星位于疾厄宫：暂无\n", 
      "田宅宫": "破军星位于田宅宫：暂无\n", 
      "身命宫": "破军星位于身命宫：暂无\n", 
      "财帛宫": "破军星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "天虚": {
    "explanation": "天虚星释义：暂无\n", 
    "zhu": 0
  }, 
  "灾煞": {
    "explanation": "灾煞星释义：暂无\n", 
    "zhu": 0
  }, 
  "天福": {
    "explanation": "天福星释义：暂无\n", 
    "zhu": 0
  }, 
  "七杀": {
    "explanation": {
      "迁移宫": "七杀星位于迁移宫：暂无\n", 
      "子女宫": "七杀星位于子女宫：暂无\n", 
      "父母宫": "七杀星位于父母宫：暂无\n", 
      "福德宫": "七杀星位于福德宫：暂无\n", 
      "仆役宫": "七杀星位于仆役宫：暂无\n", 
      "夫妻宫": "七杀星位于夫妻宫：暂无\n", 
      "官禄宫": "七杀星位于官禄宫：暂无\n", 
      "兄弟宫": "七杀星位于兄弟宫：暂无\n", 
      "疾厄宫": "七杀星位于疾厄宫：暂无\n", 
      "田宅宫": "七杀星位于田宅宫：暂无\n", 
      "身命宫": "七杀星位于身命宫：暂无\n", 
      "财帛宫": "七杀星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "贪狼": {
    "explanation": {
      "迁移宫": "贪狼星位于迁移宫：暂无\n", 
      "子女宫": "贪狼星位于子女宫：暂无\n", 
      "父母宫": "贪狼星位于父母宫：暂无\n", 
      "福德宫": "贪狼星位于福德宫：暂无\n", 
      "仆役宫": "贪狼星位于仆役宫：暂无\n", 
      "夫妻宫": "贪狼星位于夫妻宫：暂无\n", 
      "官禄宫": "贪狼星位于官禄宫：暂无\n", 
      "兄弟宫": "贪狼星位于兄弟宫：暂无\n", 
      "疾厄宫": "贪狼星位于疾厄宫：暂无\n", 
      "田宅宫": "贪狼星位于田宅宫：暂无\n", 
      "身命宫": "贪狼星位于身命宫：暂无\n", 
      "财帛宫": "贪狼星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "铃星": {
    "explanation": "铃星星释义：暂无\n", 
    "zhu": 0
  }, 
  "51": {
    "explanation": "51星释义：暂无\n", 
    "zhu": 0
  }, 
  "52": {
    "explanation": "52星释义：暂无\n", 
    "zhu": 0
  }, 
  "青龙": {
    "explanation": "青龙星释义：暂无\n", 
    "zhu": 0
  }, 
  "龙池": {
    "explanation": "龙池星释义：暂无\n", 
    "zhu": 0
  }, 
  "丧门": {
    "explanation": "丧门星释义：暂无\n", 
    "zhu": 0
  }, 
  "三台": {
    "explanation": "三台星释义：暂无\n", 
    "zhu": 0
  }, 
  "恩光": {
    "explanation": "恩光星释义：暂无\n", 
    "zhu": 0
  }, 
  "华盖": {
    "explanation": "华盖星释义：宗教，神怪，兼見貫索，刑忌，流年華蓋坐命主官司。", 
    "zhu": 0
  }, 
  "晦气": {
    "explanation": "晦气星释义：暂无\n", 
    "zhu": 0
  }, 
  "天梁": {
    "explanation": {
      "迁移宫": "天梁星位于迁移宫：暂无\n", 
      "子女宫": "天梁星位于子女宫：暂无\n", 
      "父母宫": "天梁星位于父母宫：暂无\n", 
      "福德宫": "天梁星位于福德宫：暂无\n", 
      "仆役宫": "天梁星位于仆役宫：暂无\n", 
      "夫妻宫": "天梁星位于夫妻宫：暂无\n", 
      "官禄宫": "天梁星位于官禄宫：暂无\n", 
      "兄弟宫": "天梁星位于兄弟宫：暂无\n", 
      "疾厄宫": "天梁星位于疾厄宫：暂无\n", 
      "田宅宫": "天梁星位于田宅宫：暂无\n", 
      "身命宫": "天梁星位于身命宫：暂无\n", 
      "财帛宫": "天梁星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "旬空": {
    "explanation": "旬空星释义：暂无\n", 
    "zhu": 0
  }, 
  "地劫": {
    "explanation": "地劫星释义：暂无\n", 
    "zhu": 0
  }, 
  "飞廉": {
    "explanation": "飞廉星释义：暂无\n", 
    "zhu": 0
  }, 
  "吊客": {
    "explanation": "吊客星释义：暂无\n", 
    "zhu": 0
  }, 
  "天煞": {
    "explanation": "天煞星释义：暂无\n", 
    "zhu": 0
  }, 
  "喜神": {
    "explanation": "喜神星释义：暂无\n", 
    "zhu": 0
  }, 
  "天贵": {
    "explanation": "天贵星释义：暂无\n", 
    "zhu": 0
  }, 
  "天魁": {
    "explanation": "天魁星释义：暂无\n", 
    "zhu": 0
  }, 
  "蜚廉": {
    "explanation": "蜚廉星释义：暂无\n", 
    "zhu": 0
  }, 
  "天哭": {
    "explanation": "天哭星释义：感情上打擾，損秏。", 
    "zhu": 0
  }, 
  "解神": {
    "explanation": "解神星释义：暂无\n", 
    "zhu": 0
  }, 
  "指背": {
    "explanation": "指背星释义：暂无\n", 
    "zhu": 0
  }, 
  "咸池": {
    "explanation": "咸池星释义：暂无\n", 
    "zhu": 0
  }, 
  "大耗": {
    "explanation": "大耗星释义：暂无\n", 
    "zhu": 0
  }, 
  "龙德": {
    "explanation": "龙德星释义：暂无\n", 
    "zhu": 0
  }, 
  "廉贞": {
    "explanation": {
      "迁移宫": "廉贞星位于迁移宫：暂无\n", 
      "子女宫": "廉贞星位于子女宫：暂无\n", 
      "父母宫": "廉贞星位于父母宫：暂无\n", 
      "福德宫": "廉贞星位于福德宫：暂无\n", 
      "仆役宫": "廉贞星位于仆役宫：暂无\n", 
      "夫妻宫": "廉贞星位于夫妻宫：暂无\n", 
      "官禄宫": "廉贞星位于官禄宫：暂无\n", 
      "兄弟宫": "廉贞星位于兄弟宫：暂无\n", 
      "疾厄宫": "廉贞星位于疾厄宫：暂无\n", 
      "田宅宫": "廉贞星位于田宅宫：暂无\n", 
      "身命宫": "廉贞星位于身命宫：暂无\n", 
      "财帛宫": "廉贞星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "力士": {
    "explanation": "力士星释义：暂无\n", 
    "zhu": 0
  }, 
  "八座": {
    "explanation": "八座星释义：暂无\n", 
    "zhu": 0
  }, 
  "天钺": {
    "explanation": "天钺星释义：暂无\n", 
    "zhu": 0
  }, 
  "岁建": {
    "explanation": "岁建星释义：暂无\n", 
    "zhu": 0
  }, 
  "凤阁": {
    "explanation": "凤阁星释义：暂无\n", 
    "zhu": 0
  }, 
  "寡宿": {
    "explanation": "寡宿星释义：暂无\n", 
    "zhu": 0
  }, 
  "天机": {
    "explanation": {
      "迁移宫": "天机星位于迁移宫：暂无\n", 
      "子女宫": "天机星位于子女宫：暂无\n", 
      "父母宫": "天机星位于父母宫：暂无\n", 
      "福德宫": "天机星位于福德宫：暂无\n", 
      "仆役宫": "天机星位于仆役宫：暂无\n", 
      "夫妻宫": "天机星位于夫妻宫：暂无\n", 
      "官禄宫": "天机星位于官禄宫：暂无\n", 
      "兄弟宫": "天机星位于兄弟宫：暂无\n", 
      "疾厄宫": "天机星位于疾厄宫：暂无\n", 
      "田宅宫": "天机星位于田宅宫：暂无\n", 
      "身命宫": "天机星位于身命宫：暂无\n", 
      "财帛宫": "天机星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "紫微": {
    "explanation": {
      "迁移宫": "紫微星位于迁移宫：暂无\n", 
      "子女宫": "紫微星位于子女宫：暂无\n", 
      "父母宫": "紫微星位于父母宫：暂无\n", 
      "福德宫": "紫微星位于福德宫：暂无\n", 
      "仆役宫": "紫微星位于仆役宫：暂无\n", 
      "夫妻宫": "紫微星位于夫妻宫：暂无\n", 
      "官禄宫": "紫微星位于官禄宫：暂无\n", 
      "兄弟宫": "紫微星位于兄弟宫：暂无\n", 
      "疾厄宫": "紫微星位于疾厄宫：暂无\n", 
      "田宅宫": "紫微星位于田宅宫：暂无\n", 
      "身命宫": "紫微星位于身命宫：暂无\n", 
      "财帛宫": "紫微星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "伏兵": {
    "explanation": "伏兵星释义：暂无\n", 
    "zhu": 0
  }, 
  "天官": {
    "explanation": "天官星释义：暂无\n", 
    "zhu": 0
  }, 
  "擎羊": {
    "explanation": "擎羊星释义：暂无\n", 
    "zhu": 0
  }, 
  "小耗": {
    "explanation": "小耗星释义：暂无\n", 
    "zhu": 0
  }, 
  "天使": {
    "explanation": "天使星释义：暂无\n", 
    "zhu": 0
  }, 
  "官府": {
    "explanation": "官府星释义：暂无\n", 
    "zhu": 0
  }, 
  "将星": {
    "explanation": "将星星释义：暂无\n", 
    "zhu": 0
  }, 
  "白虎": {
    "explanation": "白虎星释义：暂无\n", 
    "zhu": 0
  }, 
  "天喜": {
    "explanation": "天喜星释义：暂无\n", 
    "zhu": 0
  }, 
  "天月": {
    "explanation": "天月星释义：暂无\n", 
    "zhu": 0
  }, 
  "岁驿": {
    "explanation": "岁驿星释义：暂无\n", 
    "zhu": 0
  }, 
  "天厨": {
    "explanation": "天厨星释义：暂无\n", 
    "zhu": 0
  }, 
  "巨门": {
    "explanation": {
      "迁移宫": "巨门星位于迁移宫：暂无\n", 
      "子女宫": "巨门星位于子女宫：暂无\n", 
      "父母宫": "巨门星位于父母宫：暂无\n", 
      "福德宫": "巨门星位于福德宫：暂无\n", 
      "仆役宫": "巨门星位于仆役宫：暂无\n", 
      "夫妻宫": "巨门星位于夫妻宫：暂无\n", 
      "官禄宫": "巨门星位于官禄宫：暂无\n", 
      "兄弟宫": "巨门星位于兄弟宫：暂无\n", 
      "疾厄宫": "巨门星位于疾厄宫：暂无\n", 
      "田宅宫": "巨门星位于田宅宫：暂无\n", 
      "身命宫": "巨门星位于身命宫：暂无\n", 
      "财帛宫": "巨门星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "左辅": {
    "explanation": "左辅星释义：暂无\n", 
    "zhu": 0
  }, 
  "奏书": {
    "explanation": "奏书星释义：暂无\n", 
    "zhu": 0
  }, 
  "攀鞍": {
    "explanation": "攀鞍星释义：暂无\n", 
    "zhu": 0
  }, 
  "阴煞": {
    "explanation": "阴煞星释义：暂无\n", 
    "zhu": 0
  }, 
  "武曲": {
    "explanation": {
      "迁移宫": "武曲星位于迁移宫：暂无\n", 
      "子女宫": "武曲星位于子女宫：暂无\n", 
      "父母宫": "武曲星位于父母宫：暂无\n", 
      "福德宫": "武曲星位于福德宫：暂无\n", 
      "仆役宫": "武曲星位于仆役宫：暂无\n", 
      "夫妻宫": "武曲星位于夫妻宫：暂无\n", 
      "官禄宫": "武曲星位于官禄宫：暂无\n", 
      "兄弟宫": "武曲星位于兄弟宫：暂无\n", 
      "疾厄宫": "武曲星位于疾厄宫：暂无\n", 
      "田宅宫": "武曲星位于田宅宫：暂无\n", 
      "身命宫": "武曲星位于身命宫：暂无\n", 
      "财帛宫": "武曲星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "月德": {
    "explanation": "月德星释义：暂无\n", 
    "zhu": 0
  }, 
  "亡神": {
    "explanation": "亡神星释义：暂无\n", 
    "zhu": 0
  }, 
  "天德": {
    "explanation": "天德星释义：暂无\n", 
    "zhu": 0
  }, 
  "天马": {
    "explanation": "天马星释义：暂无\n", 
    "zhu": 0
  }, 
  "文昌": {
    "explanation": "文昌星释义：暂无\n", 
    "zhu": 0
  }, 
  "禄存": {
    "explanation": "禄存星释义：暂无\n", 
    "zhu": 0
  }, 
  "天才": {
    "explanation": "天才星释义：暂无\n", 
    "zhu": 0
  }, 
  "破碎": {
    "explanation": "破碎星释义：暂无\n", 
    "zhu": 0
  }, 
  "博士": {
    "explanation": "博士星释义：暂无\n", 
    "zhu": 0
  }, 
  "台辅": {
    "explanation": "台辅星释义：暂无\n", 
    "zhu": 0
  }, 
  "红鸾": {
    "explanation": "红鸾星释义：暂无\n", 
    "zhu": 0
  }, 
  "息神": {
    "explanation": "息神星释义：暂无\n", 
    "zhu": 0
  }, 
  "月煞": {
    "explanation": "月煞星释义：暂无\n", 
    "zhu": 0
  }, 
  "天姚": {
    "explanation": "天姚星释义：暂无\n", 
    "zhu": 0
  }, 
  "天巫": {
    "explanation": "天巫星释义：暂无\n", 
    "zhu": 0
  }, 
  "太阴": {
    "explanation": {
      "迁移宫": "太阴星位于迁移宫：暂无\n", 
      "子女宫": "太阴星位于子女宫：暂无\n", 
      "父母宫": "太阴星位于父母宫：暂无\n", 
      "福德宫": "太阴星位于福德宫：暂无\n", 
      "仆役宫": "太阴星位于仆役宫：暂无\n", 
      "夫妻宫": "太阴星位于夫妻宫：暂无\n", 
      "官禄宫": "太阴星位于官禄宫：暂无\n", 
      "兄弟宫": "太阴星位于兄弟宫：暂无\n", 
      "疾厄宫": "太阴星位于疾厄宫：暂无\n", 
      "田宅宫": "太阴星位于田宅宫：暂无\n", 
      "身命宫": "太阴星位于身命宫：暂无\n", 
      "财帛宫": "太阴星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "太阳": {
    "explanation": {
      "迁移宫": "太阳星位于迁移宫：暂无\n", 
      "子女宫": "太阳星位于子女宫：暂无\n", 
      "父母宫": "太阳星位于父母宫：暂无\n", 
      "福德宫": "太阳星位于福德宫：暂无\n", 
      "仆役宫": "太阳星位于仆役宫：暂无\n", 
      "夫妻宫": "太阳星位于夫妻宫：暂无\n", 
      "官禄宫": "太阳星位于官禄宫：暂无\n", 
      "兄弟宫": "太阳星位于兄弟宫：暂无\n", 
      "疾厄宫": "太阳星位于疾厄宫：暂无\n", 
      "田宅宫": "太阳星位于田宅宫：暂无\n", 
      "身命宫": "太阳星位于身命宫：暂无\n", 
      "财帛宫": "太阳星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "官符": {
    "explanation": "官符星释义：暂无\n", 
    "zhu": 0
  }, 
  "天同": {
    "explanation": {
      "迁移宫": "天同星位于迁移宫：暂无\n", 
      "子女宫": "天同星位于子女宫：暂无\n", 
      "父母宫": "天同星位于父母宫：暂无\n", 
      "福德宫": "天同星位于福德宫：暂无\n", 
      "仆役宫": "天同星位于仆役宫：暂无\n", 
      "夫妻宫": "天同星位于夫妻宫：暂无\n", 
      "官禄宫": "天同星位于官禄宫：暂无\n", 
      "兄弟宫": "天同星位于兄弟宫：暂无\n", 
      "疾厄宫": "天同星位于疾厄宫：暂无\n", 
      "田宅宫": "天同星位于田宅宫：暂无\n", 
      "身命宫": "天同星位于身命宫：暂无\n", 
      "财帛宫": "天同星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "截空": {
    "explanation": "截空星释义：暂无\n", 
    "zhu": 0
  }, 
  "孤辰": {
    "explanation": "孤辰星释义：暂无\n", 
    "zhu": 0
  }, 
  "地空": {
    "explanation": "地空星释义：暂无\n", 
    "zhu": 0
  }, 
  "天相": {
    "explanation": {
      "迁移宫": "天相星位于迁移宫：暂无\n", 
      "子女宫": "天相星位于子女宫：暂无\n", 
      "父母宫": "天相星位于父母宫：暂无\n", 
      "福德宫": "天相星位于福德宫：暂无\n", 
      "仆役宫": "天相星位于仆役宫：暂无\n", 
      "夫妻宫": "天相星位于夫妻宫：暂无\n", 
      "官禄宫": "天相星位于官禄宫：暂无\n", 
      "兄弟宫": "天相星位于兄弟宫：暂无\n", 
      "疾厄宫": "天相星位于疾厄宫：暂无\n", 
      "田宅宫": "天相星位于田宅宫：暂无\n", 
      "身命宫": "天相星位于身命宫：暂无\n", 
      "财帛宫": "天相星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "将军": {
    "explanation": "将军星释义：暂无\n", 
    "zhu": 0
  }, 
  "劫煞": {
    "explanation": "劫煞星释义：暂无\n", 
    "zhu": 0
  }, 
  "贯索": {
    "explanation": "贯索星释义：暂无\n", 
    "zhu": 0
  }, 
  "陀罗": {
    "explanation": "陀罗星释义：暂无\n", 
    "zhu": 0
  }, 
  "火星": {
    "explanation": "火星星释义：暂无\n", 
    "zhu": 0
  }, 
  "封诰": {
    "explanation": "封诰星释义：暂无\n", 
    "zhu": 0
  }, 
  "天刑": {
    "explanation": "天刑星释义：暂无\n", 
    "zhu": 0
  }, 
  "天府": {
    "explanation": {
      "迁移宫": "天府星位于迁移宫：暂无\n", 
      "子女宫": "天府星位于子女宫：暂无\n", 
      "父母宫": "天府星位于父母宫：暂无\n", 
      "福德宫": "天府星位于福德宫：暂无\n", 
      "仆役宫": "天府星位于仆役宫：暂无\n", 
      "夫妻宫": "天府星位于夫妻宫：暂无\n", 
      "官禄宫": "天府星位于官禄宫：暂无\n", 
      "兄弟宫": "天府星位于兄弟宫：暂无\n", 
      "疾厄宫": "天府星位于疾厄宫：暂无\n", 
      "田宅宫": "天府星位于田宅宫：暂无\n", 
      "身命宫": "天府星位于身命宫：暂无\n", 
      "财帛宫": "天府星位于财帛宫：暂无\n"
    }, 
    "zhu": 1
  }, 
  "天寿": {
    "explanation": "天寿星释义：暂无\n", 
    "zhu": 0
  }, 
  "病符": {
    "explanation": "病符星释义：\n岁前十二神的病符在流年兄弟宫，仅当入流月流日命宫时主克应。若博士、病符相叠，则病情稍严重。\n病符入财帛宫，主因病花钱，有煞忌同会，见天月，则必主慢性疾病。但病符所主，花费并不大。", 
    "zhu": 0
  }, 
  "天伤": {
    "explanation": "天伤星释义：暂无\n", 
    "zhu": 0
  }, 
  "文曲": {
    "explanation": "文曲星释义：暂无\n", 
    "zhu": 0
  }
};

exports = module.exports = obj;