var obj = {
  "天空": {
    "explanation": "天空星释义：<br>", 
    "zhu": 0
  }, 
  "右弼": {
    "explanation": "右弼星释义：<br>", 
    "zhu": 0
  }, 
  "破军": {
    "explanation": {
      "迁移宫": "破军星位于迁移宫：<br>", 
      "子女宫": "破军星位于子女宫：<br>", 
      "父母宫": "破军星位于父母宫：<br>", 
      "福德宫": "破军星位于福德宫：<br>", 
      "仆役宫": "破军星位于仆役宫：<br>", 
      "夫妻宫": "破军星位于夫妻宫：<br>", 
      "官禄宫": "破军星位于官禄宫：<br>", 
      "兄弟宫": "破军星位于兄弟宫：<br>", 
      "疾厄宫": "破军星位于疾厄宫：<br>", 
      "田宅宫": "破军星位于田宅宫：<br>", 
      "身命宫": "破军星位于身命宫：<br>", 
      "财帛宫": "破军星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "天虚": {
    "explanation": "天虚星释义：<br>", 
    "zhu": 0
  }, 
  "灾煞": {
    "explanation": "灾煞星释义：<br>将前十二神的灾煞性质为灾难，有时带凶险的性质。  <br>灾煞与沐浴同度，又见桃花，或见昌曲化忌，主因异性而惹灾祸。    <br>灾煞在命宫或疾厄宫，如与主疾病的星系配合，会加深疾病的凶险。<br>如原来的星曜吉祥，则此星曜不起作用。", 
    "zhu": 0
  }, 
  "天福": {
    "explanation": "天福星释义：<br>", 
    "zhu": 0
  }, 
  "七杀": {
    "explanation": {
      "迁移宫": "七杀星位于迁移宫：<br>", 
      "子女宫": "七杀星位于子女宫：<br>", 
      "父母宫": "七杀星位于父母宫：<br>", 
      "福德宫": "七杀星位于福德宫：<br>", 
      "仆役宫": "七杀星位于仆役宫：<br>", 
      "夫妻宫": "七杀星位于夫妻宫：<br>", 
      "官禄宫": "七杀星位于官禄宫：<br>", 
      "兄弟宫": "七杀星位于兄弟宫：<br>", 
      "疾厄宫": "七杀星位于疾厄宫：<br>", 
      "田宅宫": "七杀星位于田宅宫：<br>", 
      "身命宫": "七杀星位于身命宫：<br>", 
      "财帛宫": "七杀星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "贪狼": {
    "explanation": {
      "迁移宫": "贪狼星位于迁移宫：<br>", 
      "子女宫": "贪狼星位于子女宫：<br>", 
      "父母宫": "贪狼星位于父母宫：<br>", 
      "福德宫": "贪狼星位于福德宫：<br>", 
      "仆役宫": "贪狼星位于仆役宫：<br>", 
      "夫妻宫": "贪狼星位于夫妻宫：<br>", 
      "官禄宫": "贪狼星位于官禄宫：<br>", 
      "兄弟宫": "贪狼星位于兄弟宫：<br>", 
      "疾厄宫": "贪狼星位于疾厄宫：<br>", 
      "田宅宫": "贪狼星位于田宅宫：<br>", 
      "身命宫": "贪狼星位于身命宫：<br>", 
      "财帛宫": "贪狼星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "铃星": {
    "explanation": "铃星星释义：<br>", 
    "zhu": 0
  }, 
  "51": {
    "explanation": "51星释义：<br>", 
    "zhu": 0
  }, 
  "52": {
    "explanation": "52星释义：<br>", 
    "zhu": 0
  }, 
  "青龙": {
    "explanation": "青龙星释义：<br>", 
    "zhu": 0
  }, 
  "龙池": {
    "explanation": "龙池星释义：<br>", 
    "zhu": 0
  }, 
  "丧门": {
    "explanation": "丧门星释义：<br>岁前十二神的丧门永与白虎相对，与吊客相会，故当丧门在小限或流年命宫、父母宫、田宅宫时，便有可能有丧服之照。若流年昌曲冲会，更加强丧服的意味。", 
    "zhu": 0
  }, 
  "三台": {
    "explanation": "三台星释义：<br>", 
    "zhu": 0
  }, 
  "恩光": {
    "explanation": "恩光星释义：<br>", 
    "zhu": 0
  }, 
  "华盖": {
    "explanation": "华盖星释义：宗教，神怪，兼見貫索，刑忌，流年華蓋坐命主官司。<br>将前十二神的华盖可视为流年华盖，在命宫时，主化解灾难的力量。这种化解纯属个人意志的发挥，往往不假外力。<br>华盖阳木，在数为威仪，仪表。 华盖之性格，带孤独，而有宗教之信仰，高傲傲不群，喜助弱者，且直百无忌，君子远之，小人畏之。此星逢日月，则增威仪，且有仪表，若与孤辰成寡宿同度，男鳏，女寡之命。 ", 
    "zhu": 0
  }, 
  "晦气": {
    "explanation": "晦气星释义：<br>岁前十二神的晦气象征晦暗、暗滞。<br>晦气永与龙德相对，当龙德与吉曜同度，如流年魁钺、昌曲等，且见流年吉化时，可解晦气之恶；惟若龙德不遇吉，晦气反与流年恶煞同度，则龙德不能解其恶。<br>晦气与恶曜同度于命宫，主心情恶劣，有争执、冤屈；晦气在官禄宫、财帛宫，主因事业或发财而心情晦暗；晦气在福德宫，更见天同化忌、巨门化忌、又有流年化忌冲起，则精神不快，暗滞。", 
    "zhu": 0
  }, 
  "天梁": {
    "explanation": {
      "迁移宫": "天梁星位于迁移宫：<br>", 
      "子女宫": "天梁星位于子女宫：<br>", 
      "父母宫": "天梁星位于父母宫：<br>", 
      "福德宫": "天梁星位于福德宫：<br>", 
      "仆役宫": "天梁星位于仆役宫：<br>", 
      "夫妻宫": "天梁星位于夫妻宫：<br>", 
      "官禄宫": "天梁星位于官禄宫：<br>", 
      "兄弟宫": "天梁星位于兄弟宫：<br>", 
      "疾厄宫": "天梁星位于疾厄宫：<br>", 
      "田宅宫": "天梁星位于田宅宫：<br>", 
      "身命宫": "天梁星位于身命宫：<br>", 
      "财帛宫": "天梁星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "旬空": {
    "explanation": "旬空星释义：<br>", 
    "zhu": 0
  }, 
  "地劫": {
    "explanation": "地劫星释义：<br>", 
    "zhu": 0
  }, 
  "飞廉": {
    "explanation": "飞廉星释义：<br>博士十二神的飞廉与依年支起的蜚廉有相同的性质，主口舌。<br>飞廉与刑耗诸星同度时，主牵涉词讼，或惹起是非。", 
    "zhu": 0
  }, 
  "吊客": {
    "explanation": "吊客星释义：<br>岁前十二神的吊客永与官符相冲，与大耗、丧门相会。<br>小限或流年六亲宫位见丧门、吊客，同时有流年昌曲同会，兼且有流煞冲会，主丧服。", 
    "zhu": 0
  }, 
  "天煞": {
    "explanation": "天煞星释义：<br>将前十二神的天煞主与父辈或上司有猜疑而致破损。<br>天煞最不宜入父母宫，流年父母宫见天煞，又值煞忌刑耗冲会，则此年与父辈或上司的关系会破裂。", 
    "zhu": 0
  }, 
  "喜神": {
    "explanation": "喜神星释义：<br>喜神与昌曲同会，主带喜气的典礼。如无吉星同会，则主凡有喜事，皆有拖延，见文曲化忌尤甚。", 
    "zhu": 0
  }, 
  "天贵": {
    "explanation": "天贵星释义：<br>", 
    "zhu": 0
  }, 
  "天魁": {
    "explanation": "天魁星释义：<br>", 
    "zhu": 0
  }, 
  "蜚廉": {
    "explanation": "蜚廉星释义：<br>", 
    "zhu": 0
  }, 
  "天哭": {
    "explanation": "天哭星释义：感情上打擾，損秏。", 
    "zhu": 0
  }, 
  "解神": {
    "explanation": "解神星释义：<br>", 
    "zhu": 0
  }, 
  "指背": {
    "explanation": "指背星释义：<br>主背后遭人议论。若与科文诸曜同会，则是才高招妒。<br>指背不宜入仆役宫及兄弟宫，主下属或平辈对自己有是非谣言。", 
    "zhu": 0
  }, 
  "咸池": {
    "explanation": "咸池星释义：<br>将前十二神的咸池可视为流年咸池。咸池，主桃花、色欲、风流、佐贪廉之星。   <br>咸池与流年大耗同度或对拱时，因色招惹是非。<br>咸池亦不喜与沐浴同度，主因色破损。更嫌与成泛水桃花格局的贪狼同度，流年当务必小心。   <br>流年咸池与武曲化忌同度于夫妻宫，见煞，尤其是冲会昌曲化忌，即有配偶不忠的可能。", 
    "zhu": 0
  }, 
  "大耗": {
    "explanation": "大耗星释义：<br>岁前十二神的大耗永与岁建对冲，永与丧门、吊客相会，故为凶曜。<br>大耗不宜与天刑及流羊同度，否则犯官非口舌，如落在流年命宫、小限，皆主克应；亦不宜入财帛宫，主争执。<br>大耗阳火，在数主暗耗。 <br>大耗之性格，为喜散财，轻财而浮华，六亲不依，若与红鸾同度，不论正星庙旺与否，多主耗财，若入田宅宫，会流耗，则易遭窃盗，若加火星并巨暗入命，或田宅，主有火灾。此星入命，不宜同近亲往来，不然，多耗损而无进益。<br>博士十二神的大耗有桃花的性质。<br>大耗不宜与带浮动性的星曜同度，入天机、太阴之类，可能加强不安与耗散。<br>若大耗与贪狼同度，又与文曲化忌于三方四正相会在命宫，主人好投机、赌博，因此而破败。<br>大耗在疾厄宫，主患虚耗性的疾病，如盗汗。", 
    "zhu": 0
  }, 
  "龙德": {
    "explanation": "龙德星释义：<br>岁前十二神的龙德可以化解或减轻劫煞带来的不详。<br>龙德亦可以化解官非词讼，与奏书、解神、华盖同度时，帮助较大。<br>龙德与天寿同宫亦可以解病。", 
    "zhu": 0
  }, 
  "廉贞": {
    "explanation": {
      "迁移宫": "廉贞星位于迁移宫：<br>", 
      "子女宫": "廉贞星位于子女宫：<br>", 
      "父母宫": "廉贞星位于父母宫：<br>", 
      "福德宫": "廉贞星位于福德宫：<br>", 
      "仆役宫": "廉贞星位于仆役宫：<br>", 
      "夫妻宫": "廉贞星位于夫妻宫：<br>", 
      "官禄宫": "廉贞星位于官禄宫：<br>", 
      "兄弟宫": "廉贞星位于兄弟宫：<br>", 
      "疾厄宫": "廉贞星位于疾厄宫：<br>", 
      "田宅宫": "廉贞星位于田宅宫：<br>", 
      "身命宫": "廉贞星位于身命宫：<br>", 
      "财帛宫": "廉贞星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "力士": {
    "explanation": "力士星释义：<br>", 
    "zhu": 0
  }, 
  "八座": {
    "explanation": "八座星释义：<br>", 
    "zhu": 0
  }, 
  "天钺": {
    "explanation": "天钺星释义：<br>", 
    "zhu": 0
  }, 
  "岁建": {
    "explanation": "岁建星释义：<br>岁建与善曜同度，主一年无事；如与煞忌刑曜同度，且有流年煞忌冲叠，则主官非词讼。尤不喜与太阳化忌、巨门化忌同度，是年必有纠纷瓜葛。<br>岁建不宜与小限命宫对冲，冲则谓之犯太岁，易犯官非，多是非。", 
    "zhu": 0
  }, 
  "凤阁": {
    "explanation": "凤阁星释义：<br>", 
    "zhu": 0
  }, 
  "寡宿": {
    "explanation": "寡宿星释义：<br>", 
    "zhu": 0
  }, 
  "天机": {
    "explanation": {
      "迁移宫": "天机星位于迁移宫：<br>", 
      "子女宫": "天机星位于子女宫：<br>", 
      "父母宫": "天机星位于父母宫：<br>", 
      "福德宫": "天机星位于福德宫：<br>", 
      "仆役宫": "天机星位于仆役宫：<br>", 
      "夫妻宫": "天机星位于夫妻宫：<br>", 
      "官禄宫": "天机星位于官禄宫：<br>", 
      "兄弟宫": "天机星位于兄弟宫：<br>", 
      "疾厄宫": "天机星位于疾厄宫：<br>", 
      "田宅宫": "天机星位于田宅宫：<br>", 
      "身命宫": "天机星位于身命宫：<br>", 
      "财帛宫": "天机星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "紫微": {
    "explanation": {
      "迁移宫": "紫微星位于迁移宫：<br>", 
      "子女宫": "紫微星位于子女宫：<br>", 
      "父母宫": "紫微星位于父母宫：<br>", 
      "福德宫": "紫微星位于福德宫：<br>", 
      "仆役宫": "紫微星位于仆役宫：<br>", 
      "夫妻宫": "紫微星位于夫妻宫：<br>", 
      "官禄宫": "紫微星位于官禄宫：<br>", 
      "兄弟宫": "紫微星位于兄弟宫：<br>", 
      "疾厄宫": "紫微星位于疾厄宫：<br>", 
      "田宅宫": "紫微星位于田宅宫：<br>", 
      "身命宫": "紫微星位于身命宫：<br>", 
      "财帛宫": "紫微星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "伏兵": {
    "explanation": "伏兵星释义：<br>伏兵与天姚同度，主权术、阴谋。<br>伏兵与陀罗同度，主凡事拖延，更见铃星、空劫，主拖累。", 
    "zhu": 0
  }, 
  "天官": {
    "explanation": "天官星释义：<br>", 
    "zhu": 0
  }, 
  "擎羊": {
    "explanation": "擎羊星释义：<br>", 
    "zhu": 0
  }, 
  "小耗": {
    "explanation": "小耗星释义：<br>岁前十二神的小耗主失物、破财、超出预算。与文曲化忌同会时尤确。小耗与病符相对，所以因病破财的意义较大，以天月同度者更确。<br>病符最不宜与化忌、四煞同会，主生病，或一生多病灾，以在命宫及疾厄宫时主克应。如与贪狼、天机同度主肝病；廉贞主肾病之类。<br>病符入官禄宫、财帛宫时，对从事医药业起加强作用，", 
    "zhu": 0
  }, 
  "天使": {
    "explanation": "天使星释义：<br>", 
    "zhu": 0
  }, 
  "官府": {
    "explanation": "官府星释义：<br>官府主官非口舌词讼，怕与巨门化忌、武曲化忌、太阳化忌、太阴化忌同度，尤不喜见天刑、擎羊。", 
    "zhu": 0
  }, 
  "将星": {
    "explanation": "将星星释义：<br>将星的基本性质是代表力量，倾向于好的力量。<br>将星与魁钺同度，获得机会的力量会增加；与辅弼同度则代表助力加强，并来得直接；但与天刑、大耗同度时，并不增加或减少刑耗的力量。<br>将星最喜与紫微同度，可以帮助紫微发挥其领导力，但与太阳同度时，则虽增加其光彩，却容易变成喜出风头。", 
    "zhu": 0
  }, 
  "白虎": {
    "explanation": "白虎星释义：<br>岁前十二神的白虎永与丧门相对，与官符相会，主丧病、官非。<br>流年小限及六亲宫不宜白虎同度，若见流煞，则主克应。", 
    "zhu": 0
  }, 
  "天喜": {
    "explanation": "天喜星释义：<br>", 
    "zhu": 0
  }, 
  "天月": {
    "explanation": "天月星释义：<br>", 
    "zhu": 0
  }, 
  "岁驿": {
    "explanation": "岁驿星释义：<br>即流年的天马。<br>    当流年的禄存或化禄与岁驿同度时，亦成为禄马交驰的格局，在命宫、财帛宫、官禄宫、迁移宫，皆主进财。<br>如原局的天马与岁驿相冲，则为动象的表征，主是年有较长时间的旅行或迁动频繁。", 
    "zhu": 0
  }, 
  "天厨": {
    "explanation": "天厨星释义：<br>", 
    "zhu": 0
  }, 
  "巨门": {
    "explanation": {
      "迁移宫": "巨门星位于迁移宫：<br>", 
      "子女宫": "巨门星位于子女宫：<br>", 
      "父母宫": "巨门星位于父母宫：<br>", 
      "福德宫": "巨门星位于福德宫：<br>", 
      "仆役宫": "巨门星位于仆役宫：<br>", 
      "夫妻宫": "巨门星位于夫妻宫：<br>", 
      "官禄宫": "巨门星位于官禄宫：<br>", 
      "兄弟宫": "巨门星位于兄弟宫：<br>", 
      "疾厄宫": "巨门星位于疾厄宫：<br>", 
      "田宅宫": "巨门星位于田宅宫：<br>", 
      "身命宫": "巨门星位于身命宫：<br>", 
      "财帛宫": "巨门星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "左辅": {
    "explanation": "左辅星释义：<br>", 
    "zhu": 0
  }, 
  "奏书": {
    "explanation": "奏书星释义：<br>奏书带来的福泽皆与文字、卷版有关。<br>命宫、福德宫、官禄宫有生年奏书，则其人必擅文字；与刑忌同度，亦有刀笔之才。最喜与昌曲、魁钺同度。<br>奏书亦为官司词讼的吉神，若同会魁钺、解神、华盖、昌曲而无化忌，官司必胜；即使煞忌刑耗齐会，其处分亦较预期为轻。", 
    "zhu": 0
  }, 
  "攀鞍": {
    "explanation": "攀鞍星释义：<br>攀鞍主增加声势，可以理解为知名度，这个知名度乃由近贵而来。所以其最喜与魁钺同会。", 
    "zhu": 0
  }, 
  "阴煞": {
    "explanation": "阴煞星释义：<br>", 
    "zhu": 0
  }, 
  "武曲": {
    "explanation": {
      "迁移宫": "武曲星位于迁移宫：<br>", 
      "子女宫": "武曲星位于子女宫：<br>", 
      "父母宫": "武曲星位于父母宫：<br>", 
      "福德宫": "武曲星位于福德宫：<br>", 
      "仆役宫": "武曲星位于仆役宫：<br>", 
      "夫妻宫": "武曲星位于夫妻宫：<br>", 
      "官禄宫": "武曲星位于官禄宫：<br>", 
      "兄弟宫": "武曲星位于兄弟宫：<br>", 
      "疾厄宫": "武曲星位于疾厄宫：<br>", 
      "田宅宫": "武曲星位于田宅宫：<br>", 
      "身命宫": "武曲星位于身命宫：<br>", 
      "财帛宫": "武曲星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "月德": {
    "explanation": "月德星释义：<br>", 
    "zhu": 0
  }, 
  "亡神": {
    "explanation": "亡神星释义：<br>将前十二神的亡神主意外的破坏力，或意外的财禄损耗。<br>亡神与天马同度，又见煞忌，主凡事奔波费力，多虚少实。<br>亡神与刑耗交并，无论在命宫或福德宫，皆主其人做事浮奢，更不宜空劫同度，则更加强其虚耗浪费的程度。", 
    "zhu": 0
  }, 
  "天德": {
    "explanation": "天德星释义：<br>岁前十二神的天德可视为流年的天德。<br>流年天德与生年天德同度或对拱时，可以发挥较大的力量。天德与月德相会，有化解凶厄的力量。<br>天德喜会魁钺，主化解的力量来自长辈。", 
    "zhu": 0
  }, 
  "天马": {
    "explanation": "天马星释义：<br>", 
    "zhu": 0
  }, 
  "文昌": {
    "explanation": "文昌星释义：<br>", 
    "zhu": 0
  }, 
  "禄存": {
    "explanation": "禄存星释义：<br>", 
    "zhu": 0
  }, 
  "天才": {
    "explanation": "天才星释义：<br>", 
    "zhu": 0
  }, 
  "破碎": {
    "explanation": "破碎星释义：<br>", 
    "zhu": 0
  }, 
  "博士": {
    "explanation": "博士星释义：<br>", 
    "zhu": 0
  }, 
  "台辅": {
    "explanation": "台辅星释义：<br>", 
    "zhu": 0
  }, 
  "红鸾": {
    "explanation": "红鸾星释义：<br>", 
    "zhu": 0
  }, 
  "息神": {
    "explanation": "息神星释义：<br>息神的意义为缺乏冲劲。<br>息神处于福德宫时，往往表现为消极、悲观，不肯努力。<br>息神最不喜与天机同度，无论在命宫或福德宫，都容易发展为浅尝即止的性格。<br>息神与天梁同度，可以将天梁的原则性减轻，变得随和。<br>息神与咸池同度，表现为随便，因此容易接受感情方面的命运安排，尤其女命福德宫见此情形时，更应加强自己的意志。", 
    "zhu": 0
  }, 
  "月煞": {
    "explanation": "月煞星释义：<br>将前十二神的月煞所带来的灾厄有阴性的本质，常主与女性亲属有关。必须见煞忌诸曜冲会，性质始觉严重；若无煞曜，则来得比较温和。<br>月煞在疾厄宫，主有外表难以察觉的疾病(阴性)，无煞忌则性质较温和。<br>月煞与文曲化忌同度，见煞忌，亦主色祸。", 
    "zhu": 0
  }, 
  "天姚": {
    "explanation": "天姚星释义：<br>", 
    "zhu": 0
  }, 
  "天巫": {
    "explanation": "天巫星释义：<br>", 
    "zhu": 0
  }, 
  "太阴": {
    "explanation": {
      "迁移宫": "太阴星位于迁移宫：<br>", 
      "子女宫": "太阴星位于子女宫：<br>", 
      "父母宫": "太阴星位于父母宫：<br>", 
      "福德宫": "太阴星位于福德宫：<br>", 
      "仆役宫": "太阴星位于仆役宫：<br>", 
      "夫妻宫": "太阴星位于夫妻宫：<br>", 
      "官禄宫": "太阴星位于官禄宫：<br>", 
      "兄弟宫": "太阴星位于兄弟宫：<br>", 
      "疾厄宫": "太阴星位于疾厄宫：<br>", 
      "田宅宫": "太阴星位于田宅宫：<br>", 
      "身命宫": "太阴星位于身命宫：<br>", 
      "财帛宫": "太阴星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "太阳": {
    "explanation": {
      "迁移宫": "太阳星位于迁移宫：<br>", 
      "子女宫": "太阳星位于子女宫：<br>", 
      "父母宫": "太阳星位于父母宫：<br>", 
      "福德宫": "太阳星位于福德宫：<br>", 
      "仆役宫": "太阳星位于仆役宫：<br>", 
      "夫妻宫": "太阳星位于夫妻宫：<br>", 
      "官禄宫": "太阳星位于官禄宫：<br>", 
      "兄弟宫": "太阳星位于兄弟宫：<br>", 
      "疾厄宫": "太阳星位于疾厄宫：<br>", 
      "田宅宫": "太阳星位于田宅宫：<br>", 
      "身命宫": "太阳星位于身命宫：<br>", 
      "财帛宫": "太阳星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "官符": {
    "explanation": "官符星释义：<br>岁前十二神的官符指官司刑法的文书。<br>官符与岁建及白虎在三合宫相会时，若有煞忌相冲，则谓之太岁犯官符，在小限常主官非、是非。<br>若构成官非刑法的结构，则不宜与火星同度，否则凶事突如其来，有时为无妄之灾。", 
    "zhu": 0
  }, 
  "天同": {
    "explanation": {
      "迁移宫": "天同星位于迁移宫：<br>", 
      "子女宫": "天同星位于子女宫：<br>", 
      "父母宫": "天同星位于父母宫：<br>", 
      "福德宫": "天同星位于福德宫：<br>", 
      "仆役宫": "天同星位于仆役宫：<br>", 
      "夫妻宫": "天同星位于夫妻宫：<br>", 
      "官禄宫": "天同星位于官禄宫：<br>", 
      "兄弟宫": "天同星位于兄弟宫：<br>", 
      "疾厄宫": "天同星位于疾厄宫：<br>", 
      "田宅宫": "天同星位于田宅宫：<br>", 
      "身命宫": "天同星位于身命宫：<br>", 
      "财帛宫": "天同星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "截空": {
    "explanation": "截空星释义：<br>", 
    "zhu": 0
  }, 
  "孤辰": {
    "explanation": "孤辰星释义：<br>", 
    "zhu": 0
  }, 
  "地空": {
    "explanation": "地空星释义：<br>", 
    "zhu": 0
  }, 
  "天相": {
    "explanation": {
      "迁移宫": "天相星位于迁移宫：<br>", 
      "子女宫": "天相星位于子女宫：<br>", 
      "父母宫": "天相星位于父母宫：<br>", 
      "福德宫": "天相星位于福德宫：<br>", 
      "仆役宫": "天相星位于仆役宫：<br>", 
      "夫妻宫": "天相星位于夫妻宫：<br>", 
      "官禄宫": "天相星位于官禄宫：<br>", 
      "兄弟宫": "天相星位于兄弟宫：<br>", 
      "疾厄宫": "天相星位于疾厄宫：<br>", 
      "田宅宫": "天相星位于田宅宫：<br>", 
      "身命宫": "天相星位于身命宫：<br>", 
      "财帛宫": "天相星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "将军": {
    "explanation": "将军星释义：<br>", 
    "zhu": 0
  }, 
  "劫煞": {
    "explanation": "劫煞星释义：<br>将前十二神的劫煞，与火铃空劫同度时，若在命宫，往往主受小人剥尅，饱受精神压力。", 
    "zhu": 0
  }, 
  "贯索": {
    "explanation": "贯索星释义：<br>岁前十二神的贯索是相当重要的杂曜。辅佐煞化诸曜与贯索同宫或对拱，皆有意义上的转变。<br>对吉曜而言，犯贯索主延误或闪失；对凶曜而言，常主是非词讼，如擎羊、天刑、贯索即为官非的星系结构。<br>贯索入财帛宫，钱财不能自主，受人牵制。", 
    "zhu": 0
  }, 
  "陀罗": {
    "explanation": "陀罗星释义：<br>", 
    "zhu": 0
  }, 
  "火星": {
    "explanation": "火星星释义：<br>", 
    "zhu": 0
  }, 
  "封诰": {
    "explanation": "封诰星释义：<br>", 
    "zhu": 0
  }, 
  "天刑": {
    "explanation": "天刑星释义：<br>", 
    "zhu": 0
  }, 
  "天府": {
    "explanation": {
      "迁移宫": "天府星位于迁移宫：<br>", 
      "子女宫": "天府星位于子女宫：<br>", 
      "父母宫": "天府星位于父母宫：<br>", 
      "福德宫": "天府星位于福德宫：<br>", 
      "仆役宫": "天府星位于仆役宫：<br>", 
      "夫妻宫": "天府星位于夫妻宫：<br>", 
      "官禄宫": "天府星位于官禄宫：<br>", 
      "兄弟宫": "天府星位于兄弟宫：<br>", 
      "疾厄宫": "天府星位于疾厄宫：<br>", 
      "田宅宫": "天府星位于田宅宫：<br>", 
      "身命宫": "天府星位于身命宫：<br>", 
      "财帛宫": "天府星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "天寿": {
    "explanation": "天寿星释义：<br>", 
    "zhu": 0
  }, 
  "病符": {
    "explanation": "病符星释义：<br>岁前十二神的病符在流年兄弟宫，仅当入流月流日命宫时主克应。若博士、病符相叠，则病情稍严重。<br>病符入财帛宫，主因病花钱，有煞忌同会，见天月，则必主慢性疾病。但病符所主，花费并不大。", 
    "zhu": 0
  }, 
  "天伤": {
    "explanation": "天伤星释义：<br>", 
    "zhu": 0
  }, 
  "文曲": {
    "explanation": "文曲星释义：<br>", 
    "zhu": 0
  }
};

exports = module.exports = obj;