var obj = {
  "天空": {
    "explanation": "天空星释义：<br>阴阳五行：阳火【天空之火如电光石火，瞬间消失於无形，空中的闪电，当你想看个清楚时，它便倏忽消失，来得急，去无踪，空中也许风起云涌，也许阴霾重重，神出鬼没的「闪电」，何时会出现？在何处出现？却让人测不准，猜不透，「戊子己丑霹雳火」，即是「天空」之火的最佳象意】。<br>败化气：耗《对求财与理财而言，天空的出现确是极为不利，凭感觉行事而不重视专业，急进急退没有牌理可寻。想到就做，遇挫即停的作风，当然无法成功，难以聚财。》<br>主事：主不生财《天空之特性，想像力极强：但不具行动力。钱财的获得，最起码是要劳动肢体去搬运或争取，不是脑子一转，钱财就从天上掉下来，所以天空不生财，散财倒是一流的，因天空行事不按牌理，凡事一念间可定夺。》<br>斗分：中天凶星，上天空亡之神《不论南、北斗主星，或吉凶星曜，只要会到天空，其吉祥与凶象皆因而打了折扣，一视同仁。不论物质和精神上的得失，有了天空後，皆能大而化之，使之吉不全吉，凶也不全凶。天空丰富的想像力和原创力是新潮流和新产品的创始者，其追求完美的心态，促使其不断的挑战过去的不适，创造完美的未来。》<br>特性：守身命，作事进退，成败多端《天空守身命是指天空坐人命宫或身宫而言，当天空坐人命宫时，表示心态个性上极不稳定，凭感觉行事，急进急退，当然难以成事：当天空坐人身宫时，行动毅力欠缺，如无头苍蝇般，行动毫无轨迹可寻，到处乱闯，偶有所成，随即惨败，如无强旺主星同宫，又得运助的话，颠簸潦倒，一生不顺，盖难扭转。》<br>专长：想像力丰富，新点子多，满脑子灵感与哲理，世间任何新创意，各行各业的新产品，莫不因空劫的想像力所衍生。<br>会意：天空如天马行空，如空中飞鸟，又如人造的飞行物，虽能翱翔於空中，但若遇晴空乱流或风暴，随时有折翅断翼的可能。因其居高临下，翱翔悠游於空中，有重视精神生活的趋向，而天空也确实重视精神而轻於物质。充实心灵层面的学术追求为其所热衷，如哲学、心理学、命理学等形而上的灵活脑筋的学术。<br>天空为阳火，在数管命主，身主之宿。 天空，主灵感、飘荡之星。<br>经云：驾前一位是天空，天空原来不可逢，二主禄存若逢此，阎王不怕你英雄。驾，即生年之太岁也，前一位即安天空，身命逢之，无吉，多孤寡僧道。二主者，命主，身主也，加子属贪狼，丑亥巨门之类，若有天空同度，无吉，有煞，多主夭折。并若禄存厚重之星，虽是乘旺，而有天空同度，则虽有若无，不可以作吉论之也。（秘经云：身命四空，非僧即道，四空音，天空，地空，旬空，截空是也，又名断桥，此星若入命身，纵不作僧道，亦主犯孤独，六亲无缘，临老多入空门也。） ", 
    "zhu": 0
  }, 
  "右弼": {
    "explanation": "右弼星释义：<br>", 
    "zhu": 0
  }, 
  "破军": {
    "explanation": {
      "迁移宫": "破军星位于迁移宫：<br>", 
      "子女宫": "破军星位于子女宫：<br>", 
      "父母宫": "破军星位于父母宫：<br>", 
      "福德宫": "破军星位于福德宫：<br>", 
      "仆役宫": "破军星位于仆役宫：<br>", 
      "夫妻宫": "破军星位于夫妻宫：<br>", 
      "官禄宫": "破军星位于官禄宫：<br>", 
      "兄弟宫": "破军星位于兄弟宫：<br>", 
      "疾厄宫": "破军星位于疾厄宫：<br>", 
      "田宅宫": "破军星位于田宅宫：<br>", 
      "身命宫": "破军星位于身命宫：<br>", 
      "财帛宫": "破军星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "天虚": {
    "explanation": "天虚星释义：<br>为凶星，在丑卯申宫为入庙，反为吉，遇禄存或化禄主声名显扬。余宫落陷主凶。<br>天虚属土，主耗败与空亡。天虚入命，性格孤独，落落寡欢，与亲人朋友皆有疏淡的倾向，六亲缘薄，一生劳多而功少。逢吉星，可以减弱凶意。岁限逢哭虚，主哀泣。天虚，主错误、失败、飘浮之星。", 
    "zhu": 0
  }, 
  "灾煞": {
    "explanation": "灾煞星释义：<br>将前十二神的灾煞性质为灾难，有时带凶险的性质。  <br>灾煞与沐浴同度，又见桃花，或见昌曲化忌，主因异性而惹灾祸。    <br>灾煞在命宫或疾厄宫，如与主疾病的星系配合，会加深疾病的凶险。<br>如原来的星曜吉祥，则此星曜不起作用。", 
    "zhu": 0
  }, 
  "天福": {
    "explanation": "天福星释义：<br>", 
    "zhu": 0
  }, 
  "七杀": {
    "explanation": {
      "迁移宫": "七杀星位于迁移宫：<br>", 
      "子女宫": "七杀星位于子女宫：<br>", 
      "父母宫": "七杀星位于父母宫：<br>", 
      "福德宫": "七杀星位于福德宫：<br>", 
      "仆役宫": "七杀星位于仆役宫：<br>", 
      "夫妻宫": "七杀星位于夫妻宫：<br>", 
      "官禄宫": "七杀星位于官禄宫：<br>", 
      "兄弟宫": "七杀星位于兄弟宫：<br>", 
      "疾厄宫": "七杀星位于疾厄宫：<br>", 
      "田宅宫": "七杀星位于田宅宫：<br>", 
      "身命宫": "七杀星位于身命宫：<br>", 
      "财帛宫": "七杀星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "贪狼": {
    "explanation": {
      "迁移宫": "贪狼星位于迁移宫：<br>", 
      "子女宫": "贪狼星位于子女宫：<br>", 
      "父母宫": "贪狼星位于父母宫：<br>", 
      "福德宫": "贪狼星位于福德宫：<br>", 
      "仆役宫": "贪狼星位于仆役宫：<br>", 
      "夫妻宫": "贪狼星位于夫妻宫：<br>", 
      "官禄宫": "贪狼星位于官禄宫：<br>", 
      "兄弟宫": "贪狼星位于兄弟宫：<br>", 
      "疾厄宫": "贪狼星位于疾厄宫：<br>", 
      "田宅宫": "贪狼星位于田宅宫：<br>", 
      "身命宫": "贪狼星位于身命宫：<br>", 
      "财帛宫": "贪狼星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "铃星": {
    "explanation": "铃星星释义：<br>", 
    "zhu": 0
  }, 
  "51": {
    "explanation": "51星释义：<br>", 
    "zhu": 0
  }, 
  "52": {
    "explanation": "52星释义：<br>", 
    "zhu": 0
  }, 
  "青龙": {
    "explanation": "青龙星释义：<br>此曜可以为人带来喜事。<br>青龙可解白虎之凶，当与白虎同度或对拱时，则诸凶不克应或减凶。<br>流年青龙与昌曲同度，见红鸾、天喜，主婚姻、添丁；与魁钺、天巫同度，见天贵、天官、天福，主升迁；与贪狼化禄于田宅宫，主置业。", 
    "zhu": 0
  }, 
  "龙池": {
    "explanation": "龙池星释义：<br>二星为文明之宿，主科甲，利于考学，并有攀龙附凤之运气。守命身宫主人清奇俊秀，雅重温良。男命得之，功名显达，财禄丰厚，女命逢之貌美如花，秀外慧中，旺夫益子而志节高超。以同宫和加会、对照则力强，否则作用微弱。龙池入命身，主有耳疾，凤阁入身命，嘴或唇齿有病。<br>龙池阳水，凤阁阳士（作阳金），辅天府，天相以增享受。凤阁，主丁态、美感、术数、佐天相之星。<br>龙池之性格，为聪明，且有作为，文雅而有声誉，专辅天府之功，可增饮食之享受。凤阁之性格，为敏捷而好服饰之讲究，有文章之美而风流，亦有声誉。比二星专辅天府及天相，以增贵及享受，若入身命逢煞冲破，则龙池主有耳疾，或一 耳有聋。凤阁主牙齿早坏。 ", 
    "zhu": 0
  }, 
  "丧门": {
    "explanation": "丧门星释义：<br>岁前十二神的丧门永与白虎相对，与吊客相会，故当丧门在小限或流年命宫、父母宫、田宅宫时，便有可能有丧服之照。若流年昌曲冲会，更加强丧服的意味。", 
    "zhu": 0
  }, 
  "三台": {
    "explanation": "三台星释义：<br>三台阳土，八座阴土，辅日月之光。主正直、平和、扶主曜之星。<br>三台之性格，为耿直无私，有威仪，逢吉加吉祥。八座之性格，为直爽而急燥，口快心直，且是善良多义，逢吉加吉祥。此二星若逢日月同度，对照，及三合，可增日月之光辉，十二宫中无失陷。于病，多主胃脾之疾。于田宅，主富足，近有三列成行之房屋，及牌楼，或八字形之建筑等，以吉论。（此二星专主交通工具）。 ", 
    "zhu": 0
  }, 
  "恩光": {
    "explanation": "恩光星释义：<br>主富贵，喜二星入身命宫，则吉。恩光入命身宫、官禄宫，主受殊荣。天贵入命身宫，主人秀气豪爽，年少金榜题名，更主大贵，三合文昌，英俊聪明，居寅辰宫，为人出众，财旺名盛。岁限逢恩光，主吉利，逢天贵，喜气非常，考试及第，有官者升迁，常人发财，且多贵人，逢灾有救。<br>恩光阳火，专辅天魁。天贵阳土，专佐天钺。恩光，主光明、蒙恩之星。侥幸、特殊提携、援助。<br>恩光之性格，为处事慎重而小心，磊落而光明，有才艺，亦风流，一生多近上贵，专佐天魁以增贵，及多文艺。天贵之性格，为厚重而笃实，但略带孤僻偏激，一生多得上司之宠信与提拔，专佐天钺，以增声名及人缘。此二星乘旺入命，无论会合魁钺与否，多是重信用，言出必行之人。（此二星专主临时贵人宴会之事）。 ", 
    "zhu": 0
  }, 
  "华盖": {
    "explanation": "华盖星释义：宗教，神怪，兼見貫索，刑忌，流年華蓋坐命主官司。<br>将前十二神的华盖可视为流年华盖，在命宫时，主化解灾难的力量。这种化解纯属个人意志的发挥，往往不假外力。<br>华盖阳木，在数为威仪，仪表。 华盖之性格，带孤独，而有宗教之信仰，高傲傲不群，喜助弱者，且直百无忌，君子远之，小人畏之。此星逢日月，则增威仪，且有仪表，若与孤辰成寡宿同度，男鳏，女寡之命。 ", 
    "zhu": 0
  }, 
  "晦气": {
    "explanation": "晦气星释义：<br>岁前十二神的晦气象征晦暗、暗滞。<br>晦气永与龙德相对，当龙德与吉曜同度，如流年魁钺、昌曲等，且见流年吉化时，可解晦气之恶；惟若龙德不遇吉，晦气反与流年恶煞同度，则龙德不能解其恶。<br>晦气与恶曜同度于命宫，主心情恶劣，有争执、冤屈；晦气在官禄宫、财帛宫，主因事业或发财而心情晦暗；晦气在福德宫，更见天同化忌、巨门化忌、又有流年化忌冲起，则精神不快，暗滞。", 
    "zhu": 0
  }, 
  "天梁": {
    "explanation": {
      "迁移宫": "天梁星位于迁移宫：<br>", 
      "子女宫": "天梁星位于子女宫：<br>", 
      "父母宫": "天梁星位于父母宫：<br>", 
      "福德宫": "天梁星位于福德宫：<br>", 
      "仆役宫": "天梁星位于仆役宫：<br>", 
      "夫妻宫": "天梁星位于夫妻宫：<br>", 
      "官禄宫": "天梁星位于官禄宫：<br>", 
      "兄弟宫": "天梁星位于兄弟宫：<br>", 
      "疾厄宫": "天梁星位于疾厄宫：<br>", 
      "田宅宫": "天梁星位于田宅宫：<br>", 
      "身命宫": "天梁星位于身命宫：<br>", 
      "财帛宫": "天梁星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "旬空": {
    "explanation": "旬空星释义：<br>主空虚、化空、消失。忌入身命宫，喜入疾厄宫。丙级星。旁空正空。阴女为旁空。旬空,主耽阁，则多由自身而言。旬截二空是十干配十二地支时的阴阳缺位,但凡是星曜坐落的宫位都会变得不稳定,犹如云里月,一时现一时隐。", 
    "zhu": 0
  }, 
  "地劫": {
    "explanation": "地劫星释义：<br>", 
    "zhu": 0
  }, 
  "飞廉": {
    "explanation": "飞廉星释义：<br>博士十二神的飞廉与依年支起的蜚廉有相同的性质，主口舌。<br>飞廉与刑耗诸星同度时，主牵涉词讼，或惹起是非。", 
    "zhu": 0
  }, 
  "吊客": {
    "explanation": "吊客星释义：<br>岁前十二神的吊客永与官符相冲，与大耗、丧门相会。<br>小限或流年六亲宫位见丧门、吊客，同时有流年昌曲同会，兼且有流煞冲会，主丧服。", 
    "zhu": 0
  }, 
  "天煞": {
    "explanation": "天煞星释义：<br>将前十二神的天煞主与父辈或上司有猜疑而致破损。<br>天煞最不宜入父母宫，流年父母宫见天煞，又值煞忌刑耗冲会，则此年与父辈或上司的关系会破裂。", 
    "zhu": 0
  }, 
  "喜神": {
    "explanation": "喜神星释义：<br>喜神与昌曲同会，主带喜气的典礼。如无吉星同会，则主凡有喜事，皆有拖延，见文曲化忌尤甚。", 
    "zhu": 0
  }, 
  "天贵": {
    "explanation": "天贵星释义：<br>主富贵，喜二星入身命宫，则吉。恩光入命身宫、官禄宫，主受殊荣。天贵入命身宫，主人秀气豪爽，年少金榜题名，更主大贵，三合文昌，英俊聪明，居寅辰宫，为人出众，财旺名盛。岁限逢恩光，主吉利，逢天贵，喜气非常，考试及第，有官者升迁，常人发财，且多贵人，逢灾有救。<br>恩光阳火，专辅天魁。主光明、蒙恩之星。天贵阳土，专佐天钺。主信诺、得贵之星。事业发展、进步。<br>恩光之性格，为处事慎重而小心，磊落而光明，有才艺，亦风流，一生多近上贵，专佐天魁以增贵，及多文艺。天贵之性格，为厚重而笃实，但略带孤僻偏激，一生多得上司之宠信与提拔，专佐天钺，以增声名及人缘。此二星乘旺入命，无论会合魁钺与否，多是重信用，言出必行之人。（此二星专主临时贵人宴会之事）。 ", 
    "zhu": 0
  }, 
  "天魁": {
    "explanation": "天魁星释义：<br>", 
    "zhu": 0
  }, 
  "蜚廉": {
    "explanation": "蜚廉星释义：<br>主孤独、遭迫害，轻则播弄是非，家庭不睦，恩怨不分，为好成恶，在命身宫，主破耗、孤独与劳苦，一生招是非，苦劳多而成功少。忌入命身，兄弟、父母、夫妻、子女，主六亲刑破不全或不和，入疾厄宫主疾病缠身，入财帛宫主钱财多损，入官禄宫有小人败坏。若逢吉星同守，则可减凶。蜚廉，主小人、是非、口舌之星。", 
    "zhu": 0
  }, 
  "天哭": {
    "explanation": "天哭星释义：<br>天哭属金，主刑克与忧伤。天哭入命，性格孤独，落落寡欢，与亲人朋友皆有疏淡的倾向，六亲缘薄，一生劳多而功少。逢吉星，可以减弱凶意。天哭，主消极、忧伤之星。<br>天哭阳火，助巨门之凶。天虚阴火，助破军之凶。 <br>天哭为人，性孤僻，劳碌，仅于丑卯申三宫，加吉多福，不然，多刑克破败，若同巨暗同度，主增凶，必有丧服，再有行限之小限逢之，而有丧门同度，必有丧事，不然，破耗不免。天虚之性格，为华而不实，孤寒贫贱，六亲无依，仅宜僧道，九流，若与破耗同度，更增凶虐，到处不利，女命得之，更凶。二星若夹限，或大小二限，各得其一之时，必有破败及丧孝服之忧，必正星庙旺，禄马来救方解。感情上打擾，損秏。", 
    "zhu": 0
  }, 
  "解神": {
    "explanation": "解神星释义：<br>", 
    "zhu": 0
  }, 
  "指背": {
    "explanation": "指背星释义：<br>主背后遭人议论。若与科文诸曜同会，则是才高招妒。<br>指背不宜入仆役宫及兄弟宫，主下属或平辈对自己有是非谣言。", 
    "zhu": 0
  }, 
  "咸池": {
    "explanation": "咸池星释义：<br>将前十二神的咸池可视为流年咸池。咸池，主桃花、色欲、风流、佐贪廉之星。   <br>咸池与流年大耗同度或对拱时，因色招惹是非。<br>咸池亦不喜与沐浴同度，主因色破损。更嫌与成泛水桃花格局的贪狼同度，流年当务必小心。   <br>流年咸池与武曲化忌同度于夫妻宫，见煞，尤其是冲会昌曲化忌，即有配偶不忠的可能。", 
    "zhu": 0
  }, 
  "大耗": {
    "explanation": "大耗星释义：<br>岁前十二神的大耗永与岁建对冲，永与丧门、吊客相会，故为凶曜。<br>大耗不宜与天刑及流羊同度，否则犯官非口舌，如落在流年命宫、小限，皆主克应；亦不宜入财帛宫，主争执。<br>大耗阳火，在数主暗耗。 <br>大耗之性格，为喜散财，轻财而浮华，六亲不依，若与红鸾同度，不论正星庙旺与否，多主耗财，若入田宅宫，会流耗，则易遭窃盗，若加火星并巨暗入命，或田宅，主有火灾。此星入命，不宜同近亲往来，不然，多耗损而无进益。<br>博士十二神的大耗有桃花的性质。<br>大耗不宜与带浮动性的星曜同度，入天机、太阴之类，可能加强不安与耗散。<br>若大耗与贪狼同度，又与文曲化忌于三方四正相会在命宫，主人好投机、赌博，因此而破败。<br>大耗在疾厄宫，主患虚耗性的疾病，如盗汗。", 
    "zhu": 0
  }, 
  "龙德": {
    "explanation": "龙德星释义：<br>岁前十二神的龙德可以化解或减轻劫煞带来的不详。<br>龙德亦可以化解官非词讼，与奏书、解神、华盖同度时，帮助较大。<br>龙德与天寿同宫亦可以解病。", 
    "zhu": 0
  }, 
  "廉贞": {
    "explanation": {
      "迁移宫": "廉贞星位于迁移宫：<br>", 
      "子女宫": "廉贞星位于子女宫：<br>", 
      "父母宫": "廉贞星位于父母宫：<br>", 
      "福德宫": "廉贞星位于福德宫：<br>", 
      "仆役宫": "廉贞星位于仆役宫：<br>", 
      "夫妻宫": "廉贞星位于夫妻宫：<br>", 
      "官禄宫": "廉贞星位于官禄宫：<br>", 
      "兄弟宫": "廉贞星位于兄弟宫：<br>", 
      "疾厄宫": "廉贞星位于疾厄宫：<br>", 
      "田宅宫": "廉贞星位于田宅宫：<br>", 
      "身命宫": "廉贞星位于身命宫：<br>", 
      "财帛宫": "廉贞星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "力士": {
    "explanation": "力士星释义：<br>博士聪明力士权。<br>力士与正曜同度时，可以影响正曜的性质。如武曲化禄、化权与力士同度，主掌握财权；如与天机天梁同度，有吉化，主其计划有支配力。<br>力士最喜与化权同度，可相得益彰，尤喜破军、贪狼、武曲、太阳化权同度。<br>流年力士与流年化权同度，更见天巫、天贵、辅佐吉曜，其年决主升迁。", 
    "zhu": 0
  }, 
  "八座": {
    "explanation": "八座星释义：<br>二星属土，主贵，为吉星，喜合照或同宫，不喜分而各行。二星可辅佐紫微，主有权势，喜同宫入命或分守命身宫，得诸吉守照，则主贵显可期。得一星守命，虽可主贵，但多早年离家，出外发迹。二星之一入夫妻宫，主夫妇分离，不吉，同守夫妻宫则白首偕老。二星合守迁移宫，每得贵人之助，平步青云，单守则独力营求。<br>", 
    "zhu": 0
  }, 
  "天钺": {
    "explanation": "天钺星释义：<br>", 
    "zhu": 0
  }, 
  "岁建": {
    "explanation": "岁建星释义：<br>岁建与善曜同度，主一年无事；如与煞忌刑曜同度，且有流年煞忌冲叠，则主官非词讼。尤不喜与太阳化忌、巨门化忌同度，是年必有纠纷瓜葛。<br>岁建不宜与小限命宫对冲，冲则谓之犯太岁，易犯官非，多是非。", 
    "zhu": 0
  }, 
  "凤阁": {
    "explanation": "凤阁星释义：<br><br>二星为文明之宿，主科甲，利于考学，并有攀龙附凤之运气。守命身宫主人清奇俊秀，雅重温良。男命得之，功名显达，财禄丰厚，女命逢之貌美如花，秀外慧中，旺夫益子而志节高超。以同宫和加会、对照则力强，否则作用微弱。龙池入命身，主有耳疾，凤阁入身命，嘴或唇齿有病。<br>龙池阳水，凤阁阳士（作阳金），辅天府，天相以增享受。凤阁，主丁态、美感、术数、佐天相之星。<br>龙池之性格，为聪明，且有作为，文雅而有声誉，专辅天府之功，可增饮食之享受。凤阁之性格，为敏捷而好服饰之讲究，有文章之美而风流，亦有声誉。比二星专辅天府及天相，以增贵及享受，若入身命逢煞冲破，则龙池主有耳疾，或一 耳有聋。凤阁主牙齿早坏。 ", 
    "zhu": 0
  }, 
  "寡宿": {
    "explanation": "寡宿星释义：<br>二星为双星，在命盘中必定加会，性质相同，属凶星。入身命宫主六亲无缘，内心孤单，曲高和寡，孤傲自赏，性格顽固，到老无依，自叹孤苦，此星乃孤寡之象也。逢凶星，心理不正常。命宫有一星，三方会一星，无吉解，多主绝嗣，纵有子女，恐遭夭折，或不成器，或虽有如无，或各在一方，其人大多人际关系不佳，与亲人思想格格不入，甚难沟通。<br>入父母宫，主孤，刑克父母，早死双亲之一。<br>入兄弟宫，主兄弟称少而不同心，各怀异志。<br>入夫妻宫，夫妇缘浅，或聚少离多，男克妻而女刑夫，祸轻者夫妻不和时有争纷，更遇恶煞主生离死别，男女终身难嫁娶。<br>入子女宫，子女稀少且主较早与自己分离。<br>入财帛宫，为金钱所困，财运不佳，财来财去不易聚。<br>孤辰阳火，寡宿阴火。 ", 
    "zhu": 0
  }, 
  "天机": {
    "explanation": {
      "迁移宫": "天机星位于迁移宫：<br>", 
      "子女宫": "天机星位于子女宫：<br>", 
      "父母宫": "天机星位于父母宫：<br>", 
      "福德宫": "天机星位于福德宫：<br>", 
      "仆役宫": "天机星位于仆役宫：<br>", 
      "夫妻宫": "天机星位于夫妻宫：<br>", 
      "官禄宫": "天机星位于官禄宫：<br>", 
      "兄弟宫": "天机星位于兄弟宫：<br>", 
      "疾厄宫": "天机星位于疾厄宫：<br>", 
      "田宅宫": "天机星位于田宅宫：<br>", 
      "身命宫": "天机星位于身命宫：<br>", 
      "财帛宫": "天机星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "紫微": {
    "explanation": {
      "迁移宫": "紫微星位于迁移宫：<br>", 
      "子女宫": "紫微星位于子女宫：<br>", 
      "父母宫": "紫微星位于父母宫：<br>", 
      "福德宫": "紫微星位于福德宫：<br>", 
      "仆役宫": "紫微星位于仆役宫：<br>", 
      "夫妻宫": "紫微星位于夫妻宫：<br>", 
      "官禄宫": "紫微星位于官禄宫：<br>", 
      "兄弟宫": "紫微星位于兄弟宫：<br>", 
      "疾厄宫": "紫微星位于疾厄宫：<br>", 
      "田宅宫": "紫微星位于田宅宫：<br>", 
      "身命宫": "紫微星位于身命宫：<br>", 
      "财帛宫": "紫微星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "伏兵": {
    "explanation": "伏兵星释义：<br>伏兵与天姚同度，主权术、阴谋。<br>伏兵与陀罗同度，主凡事拖延，更见铃星、空劫，主拖累。", 
    "zhu": 0
  }, 
  "天官": {
    "explanation": "天官星释义：<br>", 
    "zhu": 0
  }, 
  "擎羊": {
    "explanation": "擎羊星释义：<br>", 
    "zhu": 0
  }, 
  "小耗": {
    "explanation": "小耗星释义：<br>小耗即小破财，如遗失、购贵物之类，且常令人生追悔之心，所以最不宜与文昌化忌、文曲化忌、蜚廉等同度。<br>生年小耗与文曲化忌同度于命宫、财帛宫、福德宫，皆主其人常遗失小物件，破耗不大，但却麻烦。于蜚廉同度，主购物不讲价，事后却悔恨埋怨。<br>流年小耗，仅对流日发生作用，常主失物。<br>岁前十二神的小耗主失物、破财、超出预算。与文曲化忌同会时尤确。小耗与病符相对，所以因病破财的意义较大，以天月同度者更确。<br>病符最不宜与化忌、四煞同会，主生病，或一生多病灾，以在命宫及疾厄宫时主克应。如与贪狼、天机同度主肝病；廉贞主肾病之类。<br>病符入官禄宫、财帛宫时，对从事医药业起加强作用，", 
    "zhu": 0
  }, 
  "天使": {
    "explanation": "天使星释义：<br>天伤阳火，天使阴火，乃上天虚耗之神，传使之宿。 天伤主虚耗及破败，天使主虚耗及窃取，被虐待等，行限忌逢相夹或大小二限各得其一之时，若正星不庙旺，加煞冲时寿元有关津矣。再若昌曲之宿与伤使同度，行限逢之，亦主丧命，天折。天伤行限逢之，易孤寡，暗耗，如煞有官非，重病，天使行限逢之加煞，易被人诬陷，被劫盗，横破等情。", 
    "zhu": 0
  }, 
  "官府": {
    "explanation": "官府星释义：<br>官府主官非口舌词讼，怕与巨门化忌、武曲化忌、太阳化忌、太阴化忌同度，尤不喜见天刑、擎羊。", 
    "zhu": 0
  }, 
  "将星": {
    "explanation": "将星星释义：<br>将星的基本性质是代表力量，倾向于好的力量。<br>将星与魁钺同度，获得机会的力量会增加；与辅弼同度则代表助力加强，并来得直接；但与天刑、大耗同度时，并不增加或减少刑耗的力量。<br>将星最喜与紫微同度，可以帮助紫微发挥其领导力，但与太阳同度时，则虽增加其光彩，却容易变成喜出风头。", 
    "zhu": 0
  }, 
  "白虎": {
    "explanation": "白虎星释义：<br>岁前十二神的白虎永与丧门相对，与官符相会，主丧病、官非。<br>流年小限及六亲宫不宜白虎同度，若见流煞，则主克应。", 
    "zhu": 0
  }, 
  "天喜": {
    "explanation": "天喜星释义：<br>    二星属木，性质相同。入命身，主人容貌美丽，聪明秀气，性格温和，异性缘好。入丑寅卯辰戌亥为入庙，有魁力，易获异性亲睐，讨人喜欢，人缘好，主有富贵，三合紫微，旌节朝堂。大小二陷及太岁逢之，主有喜庆，财禄增添，或婚姻吉兆、生育等喜庆事。大小二限之命宫、财帛、官禄宫遇红鸾天喜，常添意外之喜，或意外之获。与天姚同宫，主淫奔，行限逢此，有桃花运。<br>此二星为正当桃花星，与贪狼天姚等星的桃花不同。二星与恶煞同宫，有血光之灾。入命身，男子招美妇，女子配贵夫，婚姻早发。<br>红鸾，主婚姻、喜庆、人缘、桃花、魅力、佐贪廉之星。<br>天喜，主婚姻、喜庆、人缘、桃花、魅力、佐贪廉之星。", 
    "zhu": 0
  }, 
  "天月": {
    "explanation": "天月星释义：<br>", 
    "zhu": 0
  }, 
  "岁驿": {
    "explanation": "岁驿星释义：<br>即流年的天马。<br>    当流年的禄存或化禄与岁驿同度时，亦成为禄马交驰的格局，在命宫、财帛宫、官禄宫、迁移宫，皆主进财。<br>如原局的天马与岁驿相冲，则为动象的表征，主是年有较长时间的旅行或迁动频繁。", 
    "zhu": 0
  }, 
  "天厨": {
    "explanation": "天厨星释义：<br>", 
    "zhu": 0
  }, 
  "巨门": {
    "explanation": {
      "迁移宫": "巨门星位于迁移宫：<br>", 
      "子女宫": "巨门星位于子女宫：<br>", 
      "父母宫": "巨门星位于父母宫：<br>", 
      "福德宫": "巨门星位于福德宫：<br>", 
      "仆役宫": "巨门星位于仆役宫：<br>", 
      "夫妻宫": "巨门星位于夫妻宫：<br>", 
      "官禄宫": "巨门星位于官禄宫：<br>", 
      "兄弟宫": "巨门星位于兄弟宫：<br>", 
      "疾厄宫": "巨门星位于疾厄宫：<br>", 
      "田宅宫": "巨门星位于田宅宫：<br>", 
      "身命宫": "巨门星位于身命宫：<br>", 
      "财帛宫": "巨门星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "左辅": {
    "explanation": "左辅星释义：<br>", 
    "zhu": 0
  }, 
  "奏书": {
    "explanation": "奏书星释义：<br>奏书带来的福泽皆与文字、卷版有关。<br>命宫、福德宫、官禄宫有生年奏书，则其人必擅文字；与刑忌同度，亦有刀笔之才。最喜与昌曲、魁钺同度。<br>奏书亦为官司词讼的吉神，若同会魁钺、解神、华盖、昌曲而无化忌，官司必胜；即使煞忌刑耗齐会，其处分亦较预期为轻。", 
    "zhu": 0
  }, 
  "攀鞍": {
    "explanation": "攀鞍星释义：<br>攀鞍主增加声势，可以理解为知名度，这个知名度乃由近贵而来。所以其最喜与魁钺同会。", 
    "zhu": 0
  }, 
  "阴煞": {
    "explanation": "阴煞星释义：<br>", 
    "zhu": 0
  }, 
  "武曲": {
    "explanation": {
      "迁移宫": "武曲星位于迁移宫：<br>", 
      "子女宫": "武曲星位于子女宫：<br>", 
      "父母宫": "武曲星位于父母宫：<br>", 
      "福德宫": "武曲星位于福德宫：<br>", 
      "仆役宫": "武曲星位于仆役宫：<br>", 
      "夫妻宫": "武曲星位于夫妻宫：<br>", 
      "官禄宫": "武曲星位于官禄宫：<br>", 
      "兄弟宫": "武曲星位于兄弟宫：<br>", 
      "疾厄宫": "武曲星位于疾厄宫：<br>", 
      "田宅宫": "武曲星位于田宅宫：<br>", 
      "身命宫": "武曲星位于身命宫：<br>", 
      "财帛宫": "武曲星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "月德": {
    "explanation": "月德星释义：<br>主贵人、化灾、解难、祥和、善良之星。具有解厄、制化之功用。喜入命身宫。", 
    "zhu": 0
  }, 
  "亡神": {
    "explanation": "亡神星释义：<br>将前十二神的亡神主意外的破坏力，或意外的财禄损耗。<br>亡神与天马同度，又见煞忌，主凡事奔波费力，多虚少实。<br>亡神与刑耗交并，无论在命宫或福德宫，皆主其人做事浮奢，更不宜空劫同度，则更加强其虚耗浪费的程度。", 
    "zhu": 0
  }, 
  "天德": {
    "explanation": "天德星释义：<br>主贵人、化灾、解难、吉祥、正义之星。具有解厄、制化之功用。喜入命身宫。<br>岁前十二神的天德可视为流年的天德。<br>流年天德与生年天德同度或对拱时，可以发挥较大的力量。天德与月德相会，有化解凶厄的力量。<br>天德喜会魁钺，主化解的力量来自长辈。", 
    "zhu": 0
  }, 
  "天马": {
    "explanation": "天马星释义：<br>", 
    "zhu": 0
  }, 
  "文昌": {
    "explanation": "文昌星释义：<br>", 
    "zhu": 0
  }, 
  "禄存": {
    "explanation": "禄存星释义：<br>", 
    "zhu": 0
  }, 
  "天才": {
    "explanation": "天才星释义：<br>即才能之星，守于命身宫，主聪明机智，才能出众，声誉英扬。若逢凶星，则怀才不遇。<br>天才阴水，辅天机。天寿阳士，辅天同，天梁。 天才，主智慧、聪明、才华、直觉、佐天机之星。<br>天才之性格，为有才艺，聪明机警，有正气而仁慈。天寿之性格，为忠厚温和，且有高寿，兼是勤奋。此二星最喜会合天同，天梁或天机，增寿益智之宿，主长寿而智慧。天才于病，主神经衰弱，阳痿阴亏。天寿于病，主脾胃及湿热之症。于田宅主吉，但需参考正星而定。 ", 
    "zhu": 0
  }, 
  "破碎": {
    "explanation": "破碎星释义：<br>破碎，主残破，不全之星。<br>破碎为阴火，在数主残破不全。 <br>破碎之性格，孤寒而劳碌，坐立不甯，少成多败，且多是非。此星入命，或行限，主作事将成，而又生风波，反覆颠倒，多不称意，尤以早年逢之，若有魁钺相夹相会，主虽有贵助，而机缘不巧。 ", 
    "zhu": 0
  }, 
  "博士": {
    "explanation": "博士星释义：<br>博士聪明力士权。<br>命宫遇生年的博士星，主人聪明，但必须与辅佐诸曜同度才能发挥其吉祥的特性。与昌曲同度者主聪明才智，与魁钺同度者主得荣誉或受贵人提拔，与辅弼同度者主受人赏识。<br>如果没有辅佐吉曜同度，而在三方相会者亦可，唯表现较次。", 
    "zhu": 0
  }, 
  "台辅": {
    "explanation": "台辅星释义：<br>意志坚强，有决断力，为人正直，文才好，可获较好地位。台阁之星。象征可遭遇要人、实力者、有名之人。主坚持之星。<br>台辅阳土，专辅左辅。封诰阴士，专辅右弼。 <br>台辅之性格，为正直而刚强，有坚决之意志，及文笔之美，专辅左辅，而主贵显。封诰之性格，为精明干练，气度沉稳，聪明而有艺术之爱好，专佐右弼，而主贵显。比二星若会合魁钺左右之福寿格，当更增吉祥，财官双美。再左右若会合二星，有二姓延生，随母重拜之象。 ", 
    "zhu": 0
  }, 
  "红鸾": {
    "explanation": "红鸾星释义：<br>二星属木，性质相同。入命身，主人容貌美丽，聪明秀气，性格温和，异性缘好。入丑寅卯辰戌亥为入庙，有魁力，易获异性亲睐，讨人喜欢，人缘好，主有富贵，三合紫微，旌节朝堂。大小二陷及太岁逢之，主有喜庆，财禄增添，或婚姻吉兆、生育等喜庆事。大小二限之命宫、财帛、官禄宫遇红鸾天喜，常添意外之喜，或意外之获。与天姚同宫，主淫奔，行限逢此，有桃花运。<br>此二星为正当桃花星，与贪狼天姚等星的桃花不同。二星与恶煞同宫，有血光之灾。入命身，男子招美妇，女子配贵夫，婚姻早发。<br>红鸾，主婚姻、喜庆、人缘、桃花、魅力、佐贪廉之星。<br>天喜，主婚姻、喜庆、人缘、桃花、魅力、佐贪廉之星。", 
    "zhu": 0
  }, 
  "息神": {
    "explanation": "息神星释义：<br>息神的意义为缺乏冲劲。<br>息神处于福德宫时，往往表现为消极、悲观，不肯努力。<br>息神最不喜与天机同度，无论在命宫或福德宫，都容易发展为浅尝即止的性格。<br>息神与天梁同度，可以将天梁的原则性减轻，变得随和。<br>息神与咸池同度，表现为随便，因此容易接受感情方面的命运安排，尤其女命福德宫见此情形时，更应加强自己的意志。", 
    "zhu": 0
  }, 
  "月煞": {
    "explanation": "月煞星释义：<br>将前十二神的月煞所带来的灾厄有阴性的本质，常主与女性亲属有关。必须见煞忌诸曜冲会，性质始觉严重；若无煞曜，则来得比较温和。<br>月煞在疾厄宫，主有外表难以察觉的疾病(阴性)，无煞忌则性质较温和。<br>月煞与文曲化忌同度，见煞忌，亦主色祸。", 
    "zhu": 0
  }, 
  "天姚": {
    "explanation": "天姚星释义：<br>", 
    "zhu": 0
  }, 
  "天巫": {
    "explanation": "天巫星释义：<br>", 
    "zhu": 0
  }, 
  "太阴": {
    "explanation": {
      "迁移宫": "太阴星位于迁移宫：<br>", 
      "子女宫": "太阴星位于子女宫：<br>", 
      "父母宫": "太阴星位于父母宫：<br>", 
      "福德宫": "太阴星位于福德宫：<br>", 
      "仆役宫": "太阴星位于仆役宫：<br>", 
      "夫妻宫": "太阴星位于夫妻宫：<br>", 
      "官禄宫": "太阴星位于官禄宫：<br>", 
      "兄弟宫": "太阴星位于兄弟宫：<br>", 
      "疾厄宫": "太阴星位于疾厄宫：<br>", 
      "田宅宫": "太阴星位于田宅宫：<br>", 
      "身命宫": "太阴星位于身命宫：<br>", 
      "财帛宫": "太阴星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "太阳": {
    "explanation": {
      "迁移宫": "太阳星位于迁移宫：<br>", 
      "子女宫": "太阳星位于子女宫：<br>", 
      "父母宫": "太阳星位于父母宫：<br>", 
      "福德宫": "太阳星位于福德宫：<br>", 
      "仆役宫": "太阳星位于仆役宫：<br>", 
      "夫妻宫": "太阳星位于夫妻宫：<br>", 
      "官禄宫": "太阳星位于官禄宫：<br>", 
      "兄弟宫": "太阳星位于兄弟宫：<br>", 
      "疾厄宫": "太阳星位于疾厄宫：<br>", 
      "田宅宫": "太阳星位于田宅宫：<br>", 
      "身命宫": "太阳星位于身命宫：<br>", 
      "财帛宫": "太阳星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "官符": {
    "explanation": "官符星释义：<br>岁前十二神的官符指官司刑法的文书。<br>官符与岁建及白虎在三合宫相会时，若有煞忌相冲，则谓之太岁犯官符，在小限常主官非、是非。<br>若构成官非刑法的结构，则不宜与火星同度，否则凶事突如其来，有时为无妄之灾。", 
    "zhu": 0
  }, 
  "天同": {
    "explanation": {
      "迁移宫": "天同星位于迁移宫：<br>", 
      "子女宫": "天同星位于子女宫：<br>", 
      "父母宫": "天同星位于父母宫：<br>", 
      "福德宫": "天同星位于福德宫：<br>", 
      "仆役宫": "天同星位于仆役宫：<br>", 
      "夫妻宫": "天同星位于夫妻宫：<br>", 
      "官禄宫": "天同星位于官禄宫：<br>", 
      "兄弟宫": "天同星位于兄弟宫：<br>", 
      "疾厄宫": "天同星位于疾厄宫：<br>", 
      "田宅宫": "天同星位于田宅宫：<br>", 
      "身命宫": "天同星位于身命宫：<br>", 
      "财帛宫": "天同星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "截空": {
    "explanation": "截空星释义：<br>", 
    "zhu": 0
  }, 
  "孤辰": {
    "explanation": "孤辰星释义：<br>孤辰，含唯一之意，主独立、孤独、固执、自立之星。<br>孤辰之性格，为孤僻而固执，飘泊，而六亲不依，加煞，则多有破相残疾，及心理不正常之人。寡宿之性格，为孤独，不近人情，飘泊，而六亲不依，多相貌可憎，怪异之人。二星最忌入财帛官，不论正星庙旺与否，结果暗耗不留。入命，则男命忌孤，女忌寡。再如身命二宫逢之，则外家（即母家）多无后嗣，本家人丁亦少。 ", 
    "zhu": 0
  }, 
  "地空": {
    "explanation": "地空星释义：<br>", 
    "zhu": 0
  }, 
  "天相": {
    "explanation": {
      "迁移宫": "天相星位于迁移宫：<br>", 
      "子女宫": "天相星位于子女宫：<br>", 
      "父母宫": "天相星位于父母宫：<br>", 
      "福德宫": "天相星位于福德宫：<br>", 
      "仆役宫": "天相星位于仆役宫：<br>", 
      "夫妻宫": "天相星位于夫妻宫：<br>", 
      "官禄宫": "天相星位于官禄宫：<br>", 
      "兄弟宫": "天相星位于兄弟宫：<br>", 
      "疾厄宫": "天相星位于疾厄宫：<br>", 
      "田宅宫": "天相星位于田宅宫：<br>", 
      "身命宫": "天相星位于身命宫：<br>", 
      "财帛宫": "天相星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "将军": {
    "explanation": "将军星释义：<br>生年将军最喜与化科同度，尤喜紫微化科、太阳化科、武曲化科、昌曲化科。若在命宫或官禄宫，能增加其荣誉，令人有风光之感。<br>但将军与忌星同度，有时却因过分得意忘形而招忌，或因维持表面风光而暗中受损。将军最不喜与文曲化忌同度，主吃哑巴亏。", 
    "zhu": 0
  }, 
  "劫煞": {
    "explanation": "劫煞星释义：<br>将前十二神的劫煞，与火铃空劫同度时，若在命宫，往往主受小人剥尅，饱受精神压力。", 
    "zhu": 0
  }, 
  "贯索": {
    "explanation": "贯索星释义：<br>岁前十二神的贯索是相当重要的杂曜。辅佐煞化诸曜与贯索同宫或对拱，皆有意义上的转变。<br>对吉曜而言，犯贯索主延误或闪失；对凶曜而言，常主是非词讼，如擎羊、天刑、贯索即为官非的星系结构。<br>贯索入财帛宫，钱财不能自主，受人牵制。", 
    "zhu": 0
  }, 
  "陀罗": {
    "explanation": "陀罗星释义：<br>", 
    "zhu": 0
  }, 
  "火星": {
    "explanation": "火星星释义：<br>", 
    "zhu": 0
  }, 
  "封诰": {
    "explanation": "封诰星释义：<br>社会风评佳，会遇褒赏、表彰等利于名誉之事。封章之星。象征为封赏、表彰、佳评、名声。主稳定之星。<br>台辅阳土，专辅左辅。封诰阴士，专辅右弼。 <br>台辅之性格，为正直而刚强，有坚决之意志，及文笔之美，专辅左辅，而主贵显。封诰之性格，为精明干练，气度沉稳，聪明而有艺术之爱好，专佐右弼，而主贵显。比二星若会合魁钺左右之福寿格，当更增吉祥，财官双美。再左右若会合二星，有二姓延生，随母重拜之象。 ", 
    "zhu": 0
  }, 
  "天刑": {
    "explanation": "天刑星释义：<br>", 
    "zhu": 0
  }, 
  "天府": {
    "explanation": {
      "迁移宫": "天府星位于迁移宫：<br>", 
      "子女宫": "天府星位于子女宫：<br>", 
      "父母宫": "天府星位于父母宫：<br>", 
      "福德宫": "天府星位于福德宫：<br>", 
      "仆役宫": "天府星位于仆役宫：<br>", 
      "夫妻宫": "天府星位于夫妻宫：<br>", 
      "官禄宫": "天府星位于官禄宫：<br>", 
      "兄弟宫": "天府星位于兄弟宫：<br>", 
      "疾厄宫": "天府星位于疾厄宫：<br>", 
      "田宅宫": "天府星位于田宅宫：<br>", 
      "身命宫": "天府星位于身命宫：<br>", 
      "财帛宫": "天府星位于财帛宫：<br>"
    }, 
    "zhu": 1
  }, 
  "天寿": {
    "explanation": "天寿星释义：<br>即寿星，守于命身宫，主忠实温厚，为人勤勉，能获长寿，酉戌亥庙旺宫尤佳。十二宫中皆作吉论。<br>天才阴水，辅天机。天寿阳士，辅天同，天梁。天寿，主稳重、理智、温和、寿元、忠厚、佐天梁之星。<br>天才之性格，为有才艺，聪明机警，有正气而仁慈。天寿之性格，为忠厚温和，且有高寿，兼是勤奋。此二星最喜会合天同，天梁或天机，增寿益智之宿，主长寿而智慧。天才于病，主神经衰弱，阳痿阴亏。天寿于病，主脾胃及湿热之症。于田宅主吉，但需参考正星而定。 ", 
    "zhu": 0
  }, 
  "病符": {
    "explanation": "病符星释义：<br>岁前十二神的病符在流年兄弟宫，仅当入流月流日命宫时主克应。若博士、病符相叠，则病情稍严重。<br>病符入财帛宫，主因病花钱，有煞忌同会，见天月，则必主慢性疾病。但病符所主，花费并不大。", 
    "zhu": 0
  }, 
  "天伤": {
    "explanation": "天伤星释义：<br>天伤阳火，天使阴火，乃上天虚耗之神，传使之宿。<br>天伤主虚耗及破败，天使主虚耗及窃取，被虐待等，行限忌逢相夹或大小二限各得其一之时，若正星不庙旺，加煞冲时寿元有关津矣。再若昌曲之宿与伤使同度，行限逢之，亦主丧命，天折。天伤行限逢之，易孤寡，暗耗，如煞有官非，重病，天使行限逢之加煞，易被人诬陷，被劫盗，横破等情。", 
    "zhu": 0
  }, 
  "文曲": {
    "explanation": "文曲星释义：<br>", 
    "zhu": 0
  }
};

exports = module.exports = obj;