var obj = {
  "天空": {
    "explanation": "天空星注释：暂无", 
    "zhu": 0
  }, 
  "右弼": {
    "explanation": "右弼星注释：暂无", 
    "zhu": 0
  }, 
  "破军": {
    "explanation": {
      "迁移宫": "破军星在迁移宫注释：暂无", 
      "子女宫": "破军星在子女宫注释：暂无", 
      "父母宫": "破军星在父母宫注释：暂无", 
      "福德宫": "破军星在福德宫注释：暂无", 
      "仆役宫": "破军星在仆役宫注释：暂无", 
      "夫妻宫": "破军星在夫妻宫注释：暂无", 
      "官禄宫": "破军星在官禄宫注释：暂无", 
      "兄弟宫": "破军星在兄弟宫注释：暂无", 
      "疾厄宫": "破军星在疾厄宫注释：暂无", 
      "田宅宫": "破军星在田宅宫注释：暂无", 
      "身命宫": "破军星在身命宫注释：暂无", 
      "财帛宫": "破军星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "天虚": {
    "explanation": "天虚星注释：暂无", 
    "zhu": 0
  }, 
  "灾煞": {
    "explanation": "灾煞星注释：暂无", 
    "zhu": 0
  }, 
  "天福": {
    "explanation": "天福星注释：暂无", 
    "zhu": 0
  }, 
  "七杀": {
    "explanation": {
      "迁移宫": "七杀星在迁移宫注释：暂无", 
      "子女宫": "七杀星在子女宫注释：暂无", 
      "父母宫": "七杀星在父母宫注释：暂无", 
      "福德宫": "七杀星在福德宫注释：暂无", 
      "仆役宫": "七杀星在仆役宫注释：暂无", 
      "夫妻宫": "七杀星在夫妻宫注释：暂无", 
      "官禄宫": "七杀星在官禄宫注释：暂无", 
      "兄弟宫": "七杀星在兄弟宫注释：暂无", 
      "疾厄宫": "七杀星在疾厄宫注释：暂无", 
      "田宅宫": "七杀星在田宅宫注释：暂无", 
      "身命宫": "七杀星在身命宫注释：暂无", 
      "财帛宫": "七杀星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "贪狼": {
    "explanation": {
      "迁移宫": "贪狼星在迁移宫注释：暂无", 
      "子女宫": "贪狼星在子女宫注释：暂无", 
      "父母宫": "贪狼星在父母宫注释：暂无", 
      "福德宫": "贪狼星在福德宫注释：暂无", 
      "仆役宫": "贪狼星在仆役宫注释：暂无", 
      "夫妻宫": "贪狼星在夫妻宫注释：暂无", 
      "官禄宫": "贪狼星在官禄宫注释：暂无", 
      "兄弟宫": "贪狼星在兄弟宫注释：暂无", 
      "疾厄宫": "贪狼星在疾厄宫注释：暂无", 
      "田宅宫": "贪狼星在田宅宫注释：暂无", 
      "身命宫": "贪狼星在身命宫注释：暂无", 
      "财帛宫": "贪狼星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "铃星": {
    "explanation": "铃星星注释：暂无", 
    "zhu": 0
  }, 
  "51": {
    "explanation": "51星注释：暂无", 
    "zhu": 0
  }, 
  "52": {
    "explanation": "52星注释：暂无", 
    "zhu": 0
  }, 
  "青龙": {
    "explanation": "青龙星注释：暂无", 
    "zhu": 0
  }, 
  "龙池": {
    "explanation": "龙池星注释：暂无", 
    "zhu": 0
  }, 
  "丧门": {
    "explanation": "丧门星注释：暂无", 
    "zhu": 0
  }, 
  "三台": {
    "explanation": "三台星注释：暂无", 
    "zhu": 0
  }, 
  "恩光": {
    "explanation": "恩光星注释：暂无", 
    "zhu": 0
  }, 
  "华盖": {
    "explanation": "华盖星注释：暂无", 
    "zhu": 0
  }, 
  "晦气": {
    "explanation": "晦气星注释：暂无", 
    "zhu": 0
  }, 
  "天梁": {
    "explanation": {
      "迁移宫": "天梁星在迁移宫注释：暂无", 
      "子女宫": "天梁星在子女宫注释：暂无", 
      "父母宫": "天梁星在父母宫注释：暂无", 
      "福德宫": "天梁星在福德宫注释：暂无", 
      "仆役宫": "天梁星在仆役宫注释：暂无", 
      "夫妻宫": "天梁星在夫妻宫注释：暂无", 
      "官禄宫": "天梁星在官禄宫注释：暂无", 
      "兄弟宫": "天梁星在兄弟宫注释：暂无", 
      "疾厄宫": "天梁星在疾厄宫注释：暂无", 
      "田宅宫": "天梁星在田宅宫注释：暂无", 
      "身命宫": "天梁星在身命宫注释：暂无", 
      "财帛宫": "天梁星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "旬空": {
    "explanation": "旬空星注释：暂无", 
    "zhu": 0
  }, 
  "地劫": {
    "explanation": "地劫星注释：暂无", 
    "zhu": 0
  }, 
  "飞廉": {
    "explanation": "飞廉星注释：暂无", 
    "zhu": 0
  }, 
  "吊客": {
    "explanation": "吊客星注释：暂无", 
    "zhu": 0
  }, 
  "天煞": {
    "explanation": "天煞星注释：暂无", 
    "zhu": 0
  }, 
  "喜神": {
    "explanation": "喜神星注释：暂无", 
    "zhu": 0
  }, 
  "天贵": {
    "explanation": "天贵星注释：暂无", 
    "zhu": 0
  }, 
  "天魁": {
    "explanation": "天魁星注释：暂无", 
    "zhu": 0
  }, 
  "蜚廉": {
    "explanation": "蜚廉星注释：暂无", 
    "zhu": 0
  }, 
  "天哭": {
    "explanation": "天哭星注释：暂无", 
    "zhu": 0
  }, 
  "解神": {
    "explanation": "解神星注释：暂无", 
    "zhu": 0
  }, 
  "指背": {
    "explanation": "指背星注释：暂无", 
    "zhu": 0
  }, 
  "咸池": {
    "explanation": "咸池星注释：暂无", 
    "zhu": 0
  }, 
  "大耗": {
    "explanation": "大耗星注释：暂无", 
    "zhu": 0
  }, 
  "龙德": {
    "explanation": "龙德星注释：暂无", 
    "zhu": 0
  }, 
  "廉贞": {
    "explanation": {
      "迁移宫": "廉贞星在迁移宫注释：暂无", 
      "子女宫": "廉贞星在子女宫注释：暂无", 
      "父母宫": "廉贞星在父母宫注释：暂无", 
      "福德宫": "廉贞星在福德宫注释：暂无", 
      "仆役宫": "廉贞星在仆役宫注释：暂无", 
      "夫妻宫": "廉贞星在夫妻宫注释：暂无", 
      "官禄宫": "廉贞星在官禄宫注释：暂无", 
      "兄弟宫": "廉贞星在兄弟宫注释：暂无", 
      "疾厄宫": "廉贞星在疾厄宫注释：暂无", 
      "田宅宫": "廉贞星在田宅宫注释：暂无", 
      "身命宫": "廉贞星在身命宫注释：暂无", 
      "财帛宫": "廉贞星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "力士": {
    "explanation": "力士星注释：暂无", 
    "zhu": 0
  }, 
  "八座": {
    "explanation": "八座星注释：暂无", 
    "zhu": 0
  }, 
  "天钺": {
    "explanation": "天钺星注释：暂无", 
    "zhu": 0
  }, 
  "岁建": {
    "explanation": "岁建星注释：暂无", 
    "zhu": 0
  }, 
  "凤阁": {
    "explanation": "凤阁星注释：暂无", 
    "zhu": 0
  }, 
  "寡宿": {
    "explanation": "寡宿星注释：暂无", 
    "zhu": 0
  }, 
  "天机": {
    "explanation": {
      "迁移宫": "天机星在迁移宫注释：暂无", 
      "子女宫": "天机星在子女宫注释：暂无", 
      "父母宫": "天机星在父母宫注释：暂无", 
      "福德宫": "天机星在福德宫注释：暂无", 
      "仆役宫": "天机星在仆役宫注释：暂无", 
      "夫妻宫": "天机星在夫妻宫注释：暂无", 
      "官禄宫": "天机星在官禄宫注释：暂无", 
      "兄弟宫": "天机星在兄弟宫注释：暂无", 
      "疾厄宫": "天机星在疾厄宫注释：暂无", 
      "田宅宫": "天机星在田宅宫注释：暂无", 
      "身命宫": "天机星在身命宫注释：暂无", 
      "财帛宫": "天机星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "紫微": {
    "explanation": {
      "迁移宫": "紫微星在迁移宫注释：暂无", 
      "子女宫": "紫微星在子女宫注释：暂无", 
      "父母宫": "紫微星在父母宫注释：暂无", 
      "福德宫": "紫微星在福德宫注释：暂无", 
      "仆役宫": "紫微星在仆役宫注释：暂无", 
      "夫妻宫": "紫微星在夫妻宫注释：暂无", 
      "官禄宫": "紫微星在官禄宫注释：暂无", 
      "兄弟宫": "紫微星在兄弟宫注释：暂无", 
      "疾厄宫": "紫微星在疾厄宫注释：暂无", 
      "田宅宫": "紫微星在田宅宫注释：暂无", 
      "身命宫": "紫微星在身命宫注释：暂无", 
      "财帛宫": "紫微星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "伏兵": {
    "explanation": "伏兵星注释：暂无", 
    "zhu": 0
  }, 
  "天官": {
    "explanation": "天官星注释：暂无", 
    "zhu": 0
  }, 
  "擎羊": {
    "explanation": "擎羊星注释：暂无", 
    "zhu": 0
  }, 
  "小耗": {
    "explanation": "小耗星注释：暂无", 
    "zhu": 0
  }, 
  "天使": {
    "explanation": "天使星注释：暂无", 
    "zhu": 0
  }, 
  "官府": {
    "explanation": "官府星注释：暂无", 
    "zhu": 0
  }, 
  "将星": {
    "explanation": "将星星注释：暂无", 
    "zhu": 0
  }, 
  "白虎": {
    "explanation": "白虎星注释：暂无", 
    "zhu": 0
  }, 
  "天喜": {
    "explanation": "天喜星注释：暂无", 
    "zhu": 0
  }, 
  "天月": {
    "explanation": "天月星注释：暂无", 
    "zhu": 0
  }, 
  "岁驿": {
    "explanation": "岁驿星注释：暂无", 
    "zhu": 0
  }, 
  "天厨": {
    "explanation": "天厨星注释：暂无", 
    "zhu": 0
  }, 
  "巨门": {
    "explanation": {
      "迁移宫": "巨门星在迁移宫注释：暂无", 
      "子女宫": "巨门星在子女宫注释：暂无", 
      "父母宫": "巨门星在父母宫注释：暂无", 
      "福德宫": "巨门星在福德宫注释：暂无", 
      "仆役宫": "巨门星在仆役宫注释：暂无", 
      "夫妻宫": "巨门星在夫妻宫注释：暂无", 
      "官禄宫": "巨门星在官禄宫注释：暂无", 
      "兄弟宫": "巨门星在兄弟宫注释：暂无", 
      "疾厄宫": "巨门星在疾厄宫注释：暂无", 
      "田宅宫": "巨门星在田宅宫注释：暂无", 
      "身命宫": "巨门星在身命宫注释：暂无", 
      "财帛宫": "巨门星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "左辅": {
    "explanation": "左辅星注释：暂无", 
    "zhu": 0
  }, 
  "奏书": {
    "explanation": "奏书星注释：暂无", 
    "zhu": 0
  }, 
  "攀鞍": {
    "explanation": "攀鞍星注释：暂无", 
    "zhu": 0
  }, 
  "阴煞": {
    "explanation": "阴煞星注释：暂无", 
    "zhu": 0
  }, 
  "武曲": {
    "explanation": {
      "迁移宫": "武曲星在迁移宫注释：暂无", 
      "子女宫": "武曲星在子女宫注释：暂无", 
      "父母宫": "武曲星在父母宫注释：暂无", 
      "福德宫": "武曲星在福德宫注释：暂无", 
      "仆役宫": "武曲星在仆役宫注释：暂无", 
      "夫妻宫": "武曲星在夫妻宫注释：暂无", 
      "官禄宫": "武曲星在官禄宫注释：暂无", 
      "兄弟宫": "武曲星在兄弟宫注释：暂无", 
      "疾厄宫": "武曲星在疾厄宫注释：暂无", 
      "田宅宫": "武曲星在田宅宫注释：暂无", 
      "身命宫": "武曲星在身命宫注释：暂无", 
      "财帛宫": "武曲星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "月德": {
    "explanation": "月德星注释：暂无", 
    "zhu": 0
  }, 
  "亡神": {
    "explanation": "亡神星注释：暂无", 
    "zhu": 0
  }, 
  "天德": {
    "explanation": "天德星注释：暂无", 
    "zhu": 0
  }, 
  "天马": {
    "explanation": "天马星注释：暂无", 
    "zhu": 0
  }, 
  "文昌": {
    "explanation": "文昌星注释：暂无", 
    "zhu": 0
  }, 
  "禄存": {
    "explanation": "禄存星注释：暂无", 
    "zhu": 0
  }, 
  "天才": {
    "explanation": "天才星注释：暂无", 
    "zhu": 0
  }, 
  "破碎": {
    "explanation": "破碎星注释：暂无", 
    "zhu": 0
  }, 
  "博士": {
    "explanation": "博士星注释：暂无", 
    "zhu": 0
  }, 
  "台辅": {
    "explanation": "台辅星注释：暂无", 
    "zhu": 0
  }, 
  "红鸾": {
    "explanation": "红鸾星注释：暂无", 
    "zhu": 0
  }, 
  "息神": {
    "explanation": "息神星注释：暂无", 
    "zhu": 0
  }, 
  "月煞": {
    "explanation": "月煞星注释：暂无", 
    "zhu": 0
  }, 
  "天姚": {
    "explanation": "天姚星注释：暂无", 
    "zhu": 0
  }, 
  "天巫": {
    "explanation": "天巫星注释：暂无", 
    "zhu": 0
  }, 
  "太阴": {
    "explanation": {
      "迁移宫": "太阴星在迁移宫注释：暂无", 
      "子女宫": "太阴星在子女宫注释：暂无", 
      "父母宫": "太阴星在父母宫注释：暂无", 
      "福德宫": "太阴星在福德宫注释：暂无", 
      "仆役宫": "太阴星在仆役宫注释：暂无", 
      "夫妻宫": "太阴星在夫妻宫注释：暂无", 
      "官禄宫": "太阴星在官禄宫注释：暂无", 
      "兄弟宫": "太阴星在兄弟宫注释：暂无", 
      "疾厄宫": "太阴星在疾厄宫注释：暂无", 
      "田宅宫": "太阴星在田宅宫注释：暂无", 
      "身命宫": "太阴星在身命宫注释：暂无", 
      "财帛宫": "太阴星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "太阳": {
    "explanation": {
      "迁移宫": "太阳星在迁移宫注释：暂无", 
      "子女宫": "太阳星在子女宫注释：暂无", 
      "父母宫": "太阳星在父母宫注释：暂无", 
      "福德宫": "太阳星在福德宫注释：暂无", 
      "仆役宫": "太阳星在仆役宫注释：暂无", 
      "夫妻宫": "太阳星在夫妻宫注释：暂无", 
      "官禄宫": "太阳星在官禄宫注释：暂无", 
      "兄弟宫": "太阳星在兄弟宫注释：暂无", 
      "疾厄宫": "太阳星在疾厄宫注释：暂无", 
      "田宅宫": "太阳星在田宅宫注释：暂无", 
      "身命宫": "太阳星在身命宫注释：暂无", 
      "财帛宫": "太阳星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "官符": {
    "explanation": "官符星注释：暂无", 
    "zhu": 0
  }, 
  "天同": {
    "explanation": {
      "迁移宫": "天同星在迁移宫注释：暂无", 
      "子女宫": "天同星在子女宫注释：暂无", 
      "父母宫": "天同星在父母宫注释：暂无", 
      "福德宫": "天同星在福德宫注释：暂无", 
      "仆役宫": "天同星在仆役宫注释：暂无", 
      "夫妻宫": "天同星在夫妻宫注释：暂无", 
      "官禄宫": "天同星在官禄宫注释：暂无", 
      "兄弟宫": "天同星在兄弟宫注释：暂无", 
      "疾厄宫": "天同星在疾厄宫注释：暂无", 
      "田宅宫": "天同星在田宅宫注释：暂无", 
      "身命宫": "天同星在身命宫注释：暂无", 
      "财帛宫": "天同星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "截空": {
    "explanation": "截空星注释：暂无", 
    "zhu": 0
  }, 
  "孤辰": {
    "explanation": "孤辰星注释：暂无", 
    "zhu": 0
  }, 
  "地空": {
    "explanation": "地空星注释：暂无", 
    "zhu": 0
  }, 
  "天相": {
    "explanation": {
      "迁移宫": "天相星在迁移宫注释：暂无", 
      "子女宫": "天相星在子女宫注释：暂无", 
      "父母宫": "天相星在父母宫注释：暂无", 
      "福德宫": "天相星在福德宫注释：暂无", 
      "仆役宫": "天相星在仆役宫注释：暂无", 
      "夫妻宫": "天相星在夫妻宫注释：暂无", 
      "官禄宫": "天相星在官禄宫注释：暂无", 
      "兄弟宫": "天相星在兄弟宫注释：暂无", 
      "疾厄宫": "天相星在疾厄宫注释：暂无", 
      "田宅宫": "天相星在田宅宫注释：暂无", 
      "身命宫": "天相星在身命宫注释：暂无", 
      "财帛宫": "天相星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "将军": {
    "explanation": "将军星注释：暂无", 
    "zhu": 0
  }, 
  "劫煞": {
    "explanation": "劫煞星注释：暂无", 
    "zhu": 0
  }, 
  "贯索": {
    "explanation": "贯索星注释：暂无", 
    "zhu": 0
  }, 
  "陀罗": {
    "explanation": "陀罗星注释：暂无", 
    "zhu": 0
  }, 
  "火星": {
    "explanation": "火星星注释：暂无", 
    "zhu": 0
  }, 
  "封诰": {
    "explanation": "封诰星注释：暂无", 
    "zhu": 0
  }, 
  "天刑": {
    "explanation": "天刑星注释：暂无", 
    "zhu": 0
  }, 
  "天府": {
    "explanation": {
      "迁移宫": "天府星在迁移宫注释：暂无", 
      "子女宫": "天府星在子女宫注释：暂无", 
      "父母宫": "天府星在父母宫注释：暂无", 
      "福德宫": "天府星在福德宫注释：暂无", 
      "仆役宫": "天府星在仆役宫注释：暂无", 
      "夫妻宫": "天府星在夫妻宫注释：暂无", 
      "官禄宫": "天府星在官禄宫注释：暂无", 
      "兄弟宫": "天府星在兄弟宫注释：暂无", 
      "疾厄宫": "天府星在疾厄宫注释：暂无", 
      "田宅宫": "天府星在田宅宫注释：暂无", 
      "身命宫": "天府星在身命宫注释：暂无", 
      "财帛宫": "天府星在财帛宫注释：暂无"
    }, 
    "zhu": 1
  }, 
  "天寿": {
    "explanation": "天寿星注释：暂无", 
    "zhu": 0
  }, 
  "病符": {
    "explanation": "病符星注释：暂无", 
    "zhu": 0
  }, 
  "天伤": {
    "explanation": "天伤星注释：暂无", 
    "zhu": 0
  }, 
  "文曲": {
    "explanation": "文曲星注释：暂无", 
    "zhu": 0
  }
};

exports = module.exports = obj;